#pragma once
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/Collections/Generic/zzzz__IList_1_def.hpp"
#include "System/Collections/Generic/zzzz__Queue_1_def.hpp"
#include "System/Collections/ObjectModel/zzzz__ReadOnlyCollection_1_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__AsyncTaskMethodBuilder_1_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__AsyncTaskMethodBuilder_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__TaskAwaiter_1_def.hpp"
#include "System/Threading/Tasks/zzzz__Task_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "Unity/Services/Vivox/zzzz__ConnectionState_def.hpp"
#include "Unity/Services/Vivox/zzzz__IChatHistoryQueryResult_def.hpp"
#include "Unity/Services/Vivox/zzzz__VivoxMessage_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(ChannelSession)
namespace System::Collections::Concurrent {
template <typename TKey, typename TValue> class ConcurrentDictionary_2;
}
namespace System::Collections::Generic {
template <typename T> class IList_1;
}
namespace System::Collections::Generic {
template <typename TKey, typename TValue> struct KeyValuePair_2;
}
namespace System::Collections::Generic {
template <typename T> class List_1;
}
namespace System::Collections::Generic {
template <typename T> struct __Queue_1__Enumerator;
}

}
namespace Unity::Services::Vivox {
struct __ChannelSession___GetChannelTextMessageHistoryPageAsync_d__111;
}
namespace Unity::Services::Vivox {
struct __ChannelSession___SendChannelMessageAsync_d__44;
}
namespace Unity::Services::Vivox {
struct __ChannelSession___SetVolumeAsync_d__42;
}
// Write type traits
MARK_REF_PTR_T(::Unity::Services::Vivox::ChannelSession);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass105_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass109_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass111_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass115_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass39_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass40_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass42_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass45_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass48_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_1);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_2);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_1);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_2);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass75_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass79_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass81_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass93_0);
MARK_VAL_T(::Unity::Services::Vivox::__ChannelSession___ConnectAsync_d__43);
MARK_VAL_T(::Unity::Services::Vivox::__ChannelSession___DeleteChannelTextMessageAsync_d__77);
MARK_VAL_T(::Unity::Services::Vivox::__ChannelSession___DisconnectAsync_d__47);
MARK_VAL_T(::Unity::Services::Vivox::__ChannelSession___EditChannelTextMessageAsync_d__78);
MARK_VAL_T(::Unity::Services::Vivox::__ChannelSession___GetChannelTextMessageHistoryAsync_d__112);
MARK_VAL_T(::Unity::Services::Vivox::__ChannelSession___GetChannelTextMessageHistoryPageAsync_d__111);
MARK_VAL_T(::Unity::Services::Vivox::__ChannelSession___SendChannelMessageAsync_d__44);
MARK_VAL_T(::Unity::Services::Vivox::__ChannelSession___SetVolumeAsync_d__42);
// Type: ::<>c__DisplayClass39_0
// SizeInfo { instance_size: 24, native_size: -1, calculated_instance_size: 24, calculated_native_size: 24, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::ChannelSession::<>c__DisplayClass39_0*
class CORDL_TYPE __ChannelSession____c__DisplayClass39_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field message, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_message, put = __cordl_internal_set_message))::Unity::Services::Vivox::SessionArchiveMessage* message;

  static inline ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass39_0* New_ctor();

  /// @brief Method <HandleSessionArchiveMessage>b__0, addr 0x2fd5fb8, size 0xec, virtual false, abstract: false, final false
  inline ::System::Collections::Generic::IList_1<::Unity::Services::Vivox::VivoxMessage*>*
  _HandleSessionArchiveMessage_b__0(::StringW k, ::System::Collections::Generic::IList_1<::Unity::Services::Vivox::VivoxMessage*>* l);

  constexpr ::Unity::Services::Vivox::SessionArchiveMessage*& __cordl_internal_get_message();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::SessionArchiveMessage*> const& __cordl_internal_get_message() const;

  constexpr void __cordl_internal_set_message(::Unity::Services::Vivox::SessionArchiveMessage* value);

  /// @brief Method .ctor, addr 0x2fd1768, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ChannelSession____c__DisplayClass39_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass39_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ChannelSession____c__DisplayClass39_0(__ChannelSession____c__DisplayClass39_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass39_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ChannelSession____c__DisplayClass39_0(__ChannelSession____c__DisplayClass39_0 const&) = delete;

  /// @brief Field message, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::SessionArchiveMessage* ___message;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__ChannelSession____c__DisplayClass39_0, 0x18>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass39_0, ___message) == 0x10, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass40_0
// SizeInfo { instance_size: 24, native_size: -1, calculated_instance_size: 24, calculated_native_size: 24, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::ChannelSession::<>c__DisplayClass40_0*
class CORDL_TYPE __ChannelSession____c__DisplayClass40_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field queryId, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_queryId, put = __cordl_internal_set_queryId))::StringW queryId;

  static inline ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass40_0* New_ctor();

  /// @brief Method <HandleSessionArchiveQueryEnd>b__0, addr 0x2fd60a4, size 0x48, virtual false, abstract: false, final false
  inline bool _HandleSessionArchiveQueryEnd_b__0(::System::Collections::Generic::KeyValuePair_2<::StringW, ::System::Collections::Generic::IList_1<::Unity::Services::Vivox::VivoxMessage*>*> r);

  /// @brief Method <HandleSessionArchiveQueryEnd>b__1, addr 0x2fd60ec, size 0x48, virtual false, abstract: false, final false
  inline bool _HandleSessionArchiveQueryEnd_b__1(
      ::System::Collections::Generic::KeyValuePair_2<::StringW, ::System::Threading::Tasks::TaskCompletionSource_1<::Unity::Services::Vivox::IChatHistoryQueryResult*>*> r);

  constexpr ::StringW const& __cordl_internal_get_queryId() const;

  constexpr ::StringW& __cordl_internal_get_queryId();

  constexpr void __cordl_internal_set_queryId(::StringW value);

  /// @brief Method .ctor, addr 0x2fd1770, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ChannelSession____c__DisplayClass40_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass40_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ChannelSession____c__DisplayClass40_0(__ChannelSession____c__DisplayClass40_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass40_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ChannelSession____c__DisplayClass40_0(__ChannelSession____c__DisplayClass40_0 const&) = delete;

  /// @brief Field queryId, offset: 0x10, size: 0x8, def value: None
  ::StringW ___queryId;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__ChannelSession____c__DisplayClass40_0, 0x18>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass40_0, ___queryId) == 0x10, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass42_0
// SizeInfo { instance_size: 24, native_size: -1, calculated_instance_size: 24, calculated_native_size: 24, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::ChannelSession::<>c__DisplayClass42_0*
class CORDL_TYPE __ChannelSession____c__DisplayClass42_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field request, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_request, put = __cordl_internal_set_request))::Unity::Services::Vivox::vx_req_session_set_local_render_volume_t* request;

  static inline ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass42_0* New_ctor();

  /// @brief Method <SetVolumeAsync>b__0, addr 0x2fd613c, size 0x188, virtual false, abstract: false, final false
  inline ::System::Threading::Tasks::Task* _SetVolumeAsync_b__0(::System::IAsyncResult* result);

  constexpr ::Unity::Services::Vivox::vx_req_session_set_local_render_volume_t*& __cordl_internal_get_request();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::vx_req_session_set_local_render_volume_t*> const& __cordl_internal_get_request() const;

  constexpr void __cordl_internal_set_request(::Unity::Services::Vivox::vx_req_session_set_local_render_volume_t* value);

  /// @brief Method .ctor, addr 0x2fd6134, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ChannelSession____c__DisplayClass42_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass42_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ChannelSession____c__DisplayClass42_0(__ChannelSession____c__DisplayClass42_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass42_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ChannelSession____c__DisplayClass42_0(__ChannelSession____c__DisplayClass42_0 const&) = delete;

  /// @brief Field request, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::vx_req_session_set_local_render_volume_t* ___request;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__ChannelSession____c__DisplayClass42_0, 0x18>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass42_0, ___request) == 0x10, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<SetVolumeAsync>d__42
// SizeInfo { instance_size: 56, native_size: -1, calculated_instance_size: 56, calculated_native_size: 72, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::ChannelSession::<SetVolumeAsync>d__42
struct CORDL_TYPE __ChannelSession___SetVolumeAsync_d__42 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x2fd62c4, size 0x440, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x2fd6704, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __ChannelSession___SetVolumeAsync_d__42();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "__4__this", ty: "::Unity::Services::Vivox::ChannelSession*", modifiers: "",
  // def_value: None }, CppParam { name: "value", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__u__1", ty:
  // "::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*>", modifiers: "", def_value: None }]
  constexpr __ChannelSession___SetVolumeAsync_d__42(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder, ::Unity::Services::Vivox::ChannelSession* __4__this,
                                                    int32_t value, ::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*> __u__1) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::Unity::Services::Vivox::ChannelSession* __4__this;

  /// @brief Field value, offset: 0x28, size: 0x4, def value: None
  int32_t value;

  /// @brief Field <>u__1, offset: 0x30, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*> __u__1;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x38 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__ChannelSession___SetVolumeAsync_d__42, 0x38>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___SetVolumeAsync_d__42, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___SetVolumeAsync_d__42, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___SetVolumeAsync_d__42, __4__this) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___SetVolumeAsync_d__42, value) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___SetVolumeAsync_d__42, __u__1) == 0x30, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<ConnectAsync>d__43
// SizeInfo { instance_size: 96, native_size: -1, calculated_instance_size: 96, calculated_native_size: 112, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::ChannelSession::<ConnectAsync>d__43
struct CORDL_TYPE __ChannelSession___ConnectAsync_d__43 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x2fd6710, size 0x8bc, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x2fd6fcc, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __ChannelSession___ConnectAsync_d__43();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "__4__this", ty: "::Unity::Services::Vivox::ChannelSession*", modifiers: "",
  // def_value: None }, CppParam { name: "accessToken", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name: "connectAudio", ty: "bool", modifiers: "", def_value: None }, CppParam {
  // name: "connectText", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "switchTransmission", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "callback", ty:
  // "::System::AsyncCallback*", modifiers: "", def_value: None }, CppParam { name: "_tokenFetch_5__2", ty: "::System::Threading::Tasks::Task_1<::StringW>*", modifiers: "", def_value: None }, CppParam
  // { name: "__u__1", ty: "::System::Runtime::CompilerServices::TaskAwaiter_1<::StringW>", modifiers: "", def_value: None }, CppParam { name: "__u__2", ty:
  // "::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*>", modifiers: "", def_value: None }, CppParam { name: "__u__3", ty:
  // "::System::Runtime::CompilerServices::TaskAwaiter_1<bool>", modifiers: "", def_value: None }]
  constexpr __ChannelSession___ConnectAsync_d__43(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder, ::Unity::Services::Vivox::ChannelSession* __4__this,
                                                  ::StringW accessToken, bool connectAudio, bool connectText, bool switchTransmission, ::System::AsyncCallback* callback,
                                                  ::System::Threading::Tasks::Task_1<::StringW>* _tokenFetch_5__2, ::System::Runtime::CompilerServices::TaskAwaiter_1<::StringW> __u__1,
                                                  ::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*> __u__2,
                                                  ::System::Runtime::CompilerServices::TaskAwaiter_1<bool> __u__3) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::Unity::Services::Vivox::ChannelSession* __4__this;

  /// @brief Field accessToken, offset: 0x28, size: 0x8, def value: None
  ::StringW accessToken;

  /// @brief Field connectAudio, offset: 0x30, size: 0x1, def value: None
  bool connectAudio;

  /// @brief Field connectText, offset: 0x31, size: 0x1, def value: None
  bool connectText;

  /// @brief Field switchTransmission, offset: 0x32, size: 0x1, def value: None
  bool switchTransmission;

  /// @brief Field callback, offset: 0x38, size: 0x8, def value: None
  ::System::AsyncCallback* callback;

  /// @brief Field <tokenFetch>5__2, offset: 0x40, size: 0x8, def value: None
  ::System::Threading::Tasks::Task_1<::StringW>* _tokenFetch_5__2;

  /// @brief Field <>u__1, offset: 0x48, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter_1<::StringW> __u__1;

  /// @brief Field <>u__2, offset: 0x50, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*> __u__2;

  /// @brief Field <>u__3, offset: 0x58, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter_1<bool> __u__3;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x60 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__ChannelSession___ConnectAsync_d__43, 0x60>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___ConnectAsync_d__43, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___ConnectAsync_d__43, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___ConnectAsync_d__43, __4__this) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___ConnectAsync_d__43, accessToken) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___ConnectAsync_d__43, connectAudio) == 0x30, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___ConnectAsync_d__43, connectText) == 0x31, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___ConnectAsync_d__43, switchTransmission) == 0x32, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___ConnectAsync_d__43, callback) == 0x38, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___ConnectAsync_d__43, _tokenFetch_5__2) == 0x40, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___ConnectAsync_d__43, __u__1) == 0x48, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___ConnectAsync_d__43, __u__2) == 0x50, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___ConnectAsync_d__43, __u__3) == 0x58, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<SendChannelMessageAsync>d__44
// SizeInfo { instance_size: 64, native_size: -1, calculated_instance_size: 64, calculated_native_size: 80, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::ChannelSession::<SendChannelMessageAsync>d__44
struct CORDL_TYPE __ChannelSession___SendChannelMessageAsync_d__44 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x2fd6fd8, size 0x2c4, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x2fd729c, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __ChannelSession___SendChannelMessageAsync_d__44();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "__4__this", ty: "::Unity::Services::Vivox::ChannelSession*", modifiers: "",
  // def_value: None }, CppParam { name: "message", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name: "options", ty: "::Unity::Services::Vivox::MessageOptions*", modifiers: "",
  // def_value: None }, CppParam { name: "__u__1", ty: "::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*>", modifiers: "", def_value: None }]
  constexpr __ChannelSession___SendChannelMessageAsync_d__44(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder,
                                                             ::Unity::Services::Vivox::ChannelSession* __4__this, ::StringW message, ::Unity::Services::Vivox::MessageOptions* options,
                                                             ::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*> __u__1) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::Unity::Services::Vivox::ChannelSession* __4__this;

  /// @brief Field message, offset: 0x28, size: 0x8, def value: None
  ::StringW message;

  /// @brief Field options, offset: 0x30, size: 0x8, def value: None
  ::Unity::Services::Vivox::MessageOptions* options;

  /// @brief Field <>u__1, offset: 0x38, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*> __u__1;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x40 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__ChannelSession___SendChannelMessageAsync_d__44, 0x40>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___SendChannelMessageAsync_d__44, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___SendChannelMessageAsync_d__44, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___SendChannelMessageAsync_d__44, __4__this) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___SendChannelMessageAsync_d__44, message) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___SendChannelMessageAsync_d__44, options) == 0x30, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___SendChannelMessageAsync_d__44, __u__1) == 0x38, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass45_0
// SizeInfo { instance_size: 40, native_size: -1, calculated_instance_size: 40, calculated_native_size: 40, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::ChannelSession::<>c__DisplayClass45_0*
class CORDL_TYPE __ChannelSession____c__DisplayClass45_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this))::Unity::Services::Vivox::ChannelSession* __4__this;

  /// @brief Field ar, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_ar, put = __cordl_internal_set_ar))::Unity::Services::Vivox::AsyncNoResult* ar;

  /// @brief Field request, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_request, put = __cordl_internal_set_request))::Unity::Services::Vivox::vx_req_sessiongroup_add_session_t* request;

  static inline ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass45_0* New_ctor();

  /// @brief Method <BeginConnect>b__0, addr 0x2fd72a8, size 0x174, virtual false, abstract: false, final false
  inline void _BeginConnect_b__0(::System::IAsyncResult* result);

  constexpr ::Unity::Services::Vivox::ChannelSession*& __cordl_internal_get___4__this();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::ChannelSession*> const& __cordl_internal_get___4__this() const;

  constexpr ::Unity::Services::Vivox::AsyncNoResult*& __cordl_internal_get_ar();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::AsyncNoResult*> const& __cordl_internal_get_ar() const;

  constexpr ::Unity::Services::Vivox::vx_req_sessiongroup_add_session_t*& __cordl_internal_get_request();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::vx_req_sessiongroup_add_session_t*> const& __cordl_internal_get_request() const;

  constexpr void __cordl_internal_set___4__this(::Unity::Services::Vivox::ChannelSession* value);

  constexpr void __cordl_internal_set_ar(::Unity::Services::Vivox::AsyncNoResult* value);

  constexpr void __cordl_internal_set_request(::Unity::Services::Vivox::vx_req_sessiongroup_add_session_t* value);

  /// @brief Method .ctor, addr 0x2fd1ed0, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ChannelSession____c__DisplayClass45_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass45_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ChannelSession____c__DisplayClass45_0(__ChannelSession____c__DisplayClass45_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass45_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ChannelSession____c__DisplayClass45_0(__ChannelSession____c__DisplayClass45_0 const&) = delete;

  /// @brief Field ar, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::AsyncNoResult* ___ar;

  /// @brief Field request, offset: 0x18, size: 0x8, def value: None
  ::Unity::Services::Vivox::vx_req_sessiongroup_add_session_t* ___request;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::Unity::Services::Vivox::ChannelSession* _____4__this;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__ChannelSession____c__DisplayClass45_0, 0x28>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass45_0, ___ar) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass45_0, ___request) == 0x18, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass45_0, _____4__this) == 0x20, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<DisconnectAsync>d__47
// SizeInfo { instance_size: 48, native_size: -1, calculated_instance_size: 48, calculated_native_size: 64, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::ChannelSession::<DisconnectAsync>d__47
struct CORDL_TYPE __ChannelSession___DisconnectAsync_d__47 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x2fd741c, size 0x374, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x2fd7790, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __ChannelSession___DisconnectAsync_d__47();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "__4__this", ty: "::Unity::Services::Vivox::ChannelSession*", modifiers: "",
  // def_value: None }, CppParam { name: "__u__1", ty: "::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*>", modifiers: "", def_value: None }]
  constexpr __ChannelSession___DisconnectAsync_d__47(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder, ::Unity::Services::Vivox::ChannelSession* __4__this,
                                                     ::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*> __u__1) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::Unity::Services::Vivox::ChannelSession* __4__this;

  /// @brief Field <>u__1, offset: 0x28, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*> __u__1;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x30 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__ChannelSession___DisconnectAsync_d__47, 0x30>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___DisconnectAsync_d__47, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___DisconnectAsync_d__47, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___DisconnectAsync_d__47, __4__this) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession___DisconnectAsync_d__47, __u__1) == 0x28, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass48_0
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::ChannelSession::<>c__DisplayClass48_0*
class CORDL_TYPE __ChannelSession____c__DisplayClass48_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field ar, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_ar, put = __cordl_internal_set_ar))::Unity::Services::Vivox::AsyncNoResult* ar;

  /// @brief Field request, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_request, put = __cordl_internal_set_request))::Unity::Services::Vivox::vx_req_sessiongroup_remove_session_t* request;

  static inline ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass48_0* New_ctor();

  /// @brief Method <Disconnect>b__0, addr 0x2fd779c, size 0x144, virtual false, abstract: false, final false
  inline void _Disconnect_b__0(::System::IAsyncResult* result);

  constexpr ::Unity::Services::Vivox::AsyncNoResult*& __cordl_internal_get_ar();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::AsyncNoResult*> const& __cordl_internal_get_ar() const;

  constexpr ::Unity::Services::Vivox::vx_req_sessiongroup_remove_session_t*& __cordl_internal_get_request();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::vx_req_sessiongroup_remove_session_t*> const& __cordl_internal_get_request() const;

  constexpr void __cordl_internal_set_ar(::Unity::Services::Vivox::AsyncNoResult* value);

  constexpr void __cordl_internal_set_request(::Unity::Services::Vivox::vx_req_sessiongroup_remove_session_t* value);

  /// @brief Method .ctor, addr 0x2fd26d8, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ChannelSession____c__DisplayClass48_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass48_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ChannelSession____c__DisplayClass48_0(__ChannelSession____c__DisplayClass48_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass48_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ChannelSession____c__DisplayClass48_0(__ChannelSession____c__DisplayClass48_0 const&) = delete;

  /// @brief Field ar, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::AsyncNoResult* ___ar;

  /// @brief Field request, offset: 0x18, size: 0x8, def value: None
  ::Unity::Services::Vivox::vx_req_sessiongroup_remove_session_t* ___request;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__ChannelSession____c__DisplayClass48_0, 0x20>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass48_0, ___ar) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass48_0, ___request) == 0x18, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass49_0
// SizeInfo { instance_size: 24, native_size: -1, calculated_instance_size: 24, calculated_native_size: 24, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::ChannelSession::<>c__DisplayClass49_0*
class CORDL_TYPE __ChannelSession____c__DisplayClass49_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field ar, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_ar, put = __cordl_internal_set_ar))::Unity::Services::Vivox::AsyncNoResult* ar;

  static inline ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_0* New_ctor();

  constexpr ::Unity::Services::Vivox::AsyncNoResult*& __cordl_internal_get_ar();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::AsyncNoResult*> const& __cordl_internal_get_ar() const;

  constexpr void __cordl_internal_set_ar(::Unity::Services::Vivox::AsyncNoResult* value);

  /// @brief Method .ctor, addr 0x2fd2a14, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ChannelSession____c__DisplayClass49_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass49_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ChannelSession____c__DisplayClass49_0(__ChannelSession____c__DisplayClass49_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass49_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ChannelSession____c__DisplayClass49_0(__ChannelSession____c__DisplayClass49_0 const&) = delete;

  /// @brief Field ar, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::AsyncNoResult* ___ar;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_0, 0x18>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_0, ___ar) == 0x10, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass49_1
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::ChannelSession::<>c__DisplayClass49_1*
class CORDL_TYPE __ChannelSession____c__DisplayClass49_1 : public ::System::Object {
public:
  // Declarations
  /// @brief Field CS$<>8__locals1, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_CS$__8__locals1, put = __cordl_internal_set_CS$__8__locals1))::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_0* CS$__8__locals1;

  /// @brief Field request, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_request, put = __cordl_internal_set_request))::Unity::Services::Vivox::vx_req_session_media_connect_t* request;

  static inline ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_1* New_ctor();

  /// @brief Method <BeginSetAudioConnected>b__0, addr 0x2fd78e0, size 0x160, virtual false, abstract: false, final false
  inline void _BeginSetAudioConnected_b__0(::System::IAsyncResult* result);

  constexpr ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_0*& __cordl_internal_get_CS$__8__locals1();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_0*> const& __cordl_internal_get_CS$__8__locals1() const;

  constexpr ::Unity::Services::Vivox::vx_req_session_media_connect_t*& __cordl_internal_get_request();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::vx_req_session_media_connect_t*> const& __cordl_internal_get_request() const;

  constexpr void __cordl_internal_set_CS$__8__locals1(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_0* value);

  constexpr void __cordl_internal_set_request(::Unity::Services::Vivox::vx_req_session_media_connect_t* value);

  /// @brief Method .ctor, addr 0x2fd2a1c, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ChannelSession____c__DisplayClass49_1();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass49_1", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ChannelSession____c__DisplayClass49_1(__ChannelSession____c__DisplayClass49_1&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass49_1", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ChannelSession____c__DisplayClass49_1(__ChannelSession____c__DisplayClass49_1 const&) = delete;

  /// @brief Field request, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::vx_req_session_media_connect_t* ___request;

  /// @brief Field CS$<>8__locals1, offset: 0x18, size: 0x8, def value: None
  ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_0* ___CS$__8__locals1;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_1, 0x20>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_1, ___request) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_1, ___CS$__8__locals1) == 0x18, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass49_2
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::ChannelSession::<>c__DisplayClass49_2*
class CORDL_TYPE __ChannelSession____c__DisplayClass49_2 : public ::System::Object {
public:
  // Declarations
  /// @brief Field CS$<>8__locals2, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_CS$__8__locals2, put = __cordl_internal_set_CS$__8__locals2))::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_0* CS$__8__locals2;

  /// @brief Field request, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_request, put = __cordl_internal_set_request))::Unity::Services::Vivox::vx_req_session_media_disconnect_t* request;

  static inline ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_2* New_ctor();

  /// @brief Method <BeginSetAudioConnected>b__1, addr 0x2fd7a40, size 0x160, virtual false, abstract: false, final false
  inline void _BeginSetAudioConnected_b__1(::System::IAsyncResult* result);

  constexpr ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_0*& __cordl_internal_get_CS$__8__locals2();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_0*> const& __cordl_internal_get_CS$__8__locals2() const;

  constexpr ::Unity::Services::Vivox::vx_req_session_media_disconnect_t*& __cordl_internal_get_request();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::vx_req_session_media_disconnect_t*> const& __cordl_internal_get_request() const;

  constexpr void __cordl_internal_set_CS$__8__locals2(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_0* value);

  constexpr void __cordl_internal_set_request(::Unity::Services::Vivox::vx_req_session_media_disconnect_t* value);

  /// @brief Method .ctor, addr 0x2fd2a24, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ChannelSession____c__DisplayClass49_2();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass49_2", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ChannelSession____c__DisplayClass49_2(__ChannelSession____c__DisplayClass49_2&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass49_2", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ChannelSession____c__DisplayClass49_2(__ChannelSession____c__DisplayClass49_2 const&) = delete;

  /// @brief Field request, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::vx_req_session_media_disconnect_t* ___request;

  /// @brief Field CS$<>8__locals2, offset: 0x18, size: 0x8, def value: None
  ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_0* ___CS$__8__locals2;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_2, 0x20>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_2, ___request) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass49_2, ___CS$__8__locals2) == 0x18, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass51_0
// SizeInfo { instance_size: 24, native_size: -1, calculated_instance_size: 24, calculated_native_size: 24, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::ChannelSession::<>c__DisplayClass51_0*
class CORDL_TYPE __ChannelSession____c__DisplayClass51_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field ar, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_ar, put = __cordl_internal_set_ar))::Unity::Services::Vivox::AsyncNoResult* ar;

  static inline ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_0* New_ctor();

  constexpr ::Unity::Services::Vivox::AsyncNoResult*& __cordl_internal_get_ar();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::AsyncNoResult*> const& __cordl_internal_get_ar() const;

  constexpr void __cordl_internal_set_ar(::Unity::Services::Vivox::AsyncNoResult* value);

  /// @brief Method .ctor, addr 0x2fd2de0, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ChannelSession____c__DisplayClass51_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass51_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ChannelSession____c__DisplayClass51_0(__ChannelSession____c__DisplayClass51_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass51_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ChannelSession____c__DisplayClass51_0(__ChannelSession____c__DisplayClass51_0 const&) = delete;

  /// @brief Field ar, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::AsyncNoResult* ___ar;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_0, 0x18>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_0, ___ar) == 0x10, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass51_1
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::ChannelSession::<>c__DisplayClass51_1*
class CORDL_TYPE __ChannelSession____c__DisplayClass51_1 : public ::System::Object {
public:
  // Declarations
  /// @brief Field CS$<>8__locals1, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_CS$__8__locals1, put = __cordl_internal_set_CS$__8__locals1))::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_0* CS$__8__locals1;

  /// @brief Field request, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_request, put = __cordl_internal_set_request))::Unity::Services::Vivox::vx_req_session_text_connect_t* request;

  static inline ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_1* New_ctor();

  /// @brief Method <BeginSetTextConnected>b__0, addr 0x2fd7ba0, size 0x160, virtual false, abstract: false, final false
  inline void _BeginSetTextConnected_b__0(::System::IAsyncResult* result);

  constexpr ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_0*& __cordl_internal_get_CS$__8__locals1();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_0*> const& __cordl_internal_get_CS$__8__locals1() const;

  constexpr ::Unity::Services::Vivox::vx_req_session_text_connect_t*& __cordl_internal_get_request();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::vx_req_session_text_connect_t*> const& __cordl_internal_get_request() const;

  constexpr void __cordl_internal_set_CS$__8__locals1(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_0* value);

  constexpr void __cordl_internal_set_request(::Unity::Services::Vivox::vx_req_session_text_connect_t* value);

  /// @brief Method .ctor, addr 0x2fd2de8, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ChannelSession____c__DisplayClass51_1();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass51_1", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ChannelSession____c__DisplayClass51_1(__ChannelSession____c__DisplayClass51_1&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass51_1", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ChannelSession____c__DisplayClass51_1(__ChannelSession____c__DisplayClass51_1 const&) = delete;

  /// @brief Field request, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::vx_req_session_text_connect_t* ___request;

  /// @brief Field CS$<>8__locals1, offset: 0x18, size: 0x8, def value: None
  ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_0* ___CS$__8__locals1;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_1, 0x20>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_1, ___request) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_1, ___CS$__8__locals1) == 0x18, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass51_2
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::ChannelSession::<>c__DisplayClass51_2*
class CORDL_TYPE __ChannelSession____c__DisplayClass51_2 : public ::System::Object {
public:
  // Declarations
  /// @brief Field CS$<>8__locals2, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_CS$__8__locals2, put = __cordl_internal_set_CS$__8__locals2))::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_0* CS$__8__locals2;

  /// @brief Field request, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_request, put = __cordl_internal_set_request))::Unity::Services::Vivox::vx_req_session_text_disconnect_t* request;

  static inline ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_2* New_ctor();

  /// @brief Method <BeginSetTextConnected>b__1, addr 0x2fd7d00, size 0x160, virtual false, abstract: false, final false
  inline void _BeginSetTextConnected_b__1(::System::IAsyncResult* result);

  constexpr ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_0*& __cordl_internal_get_CS$__8__locals2();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_0*> const& __cordl_internal_get_CS$__8__locals2() const;

  constexpr ::Unity::Services::Vivox::vx_req_session_text_disconnect_t*& __cordl_internal_get_request();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::vx_req_session_text_disconnect_t*> const& __cordl_internal_get_request() const;

  constexpr void __cordl_internal_set_CS$__8__locals2(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_0* value);

  constexpr void __cordl_internal_set_request(::Unity::Services::Vivox::vx_req_session_text_disconnect_t* value);

  /// @brief Method .ctor, addr 0x2fd2df0, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ChannelSession____c__DisplayClass51_2();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass51_2", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ChannelSession____c__DisplayClass51_2(__ChannelSession____c__DisplayClass51_2&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ChannelSession____c__DisplayClass51_2", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ChannelSession____c__DisplayClass51_2(__ChannelSession____c__DisplayClass51_2 const&) = delete;

  /// @brief Field request, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::vx_req_session_text_disconnect_t* ___request;

  /// @brief Field CS$<>8__locals2, offset: 0x18, size: 0x8, def value: None
  ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_0* ___CS$__8__locals2;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_2, 0x20>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_2, ___request) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__ChannelSession____c__DisplayClass51_2, ___CS$__8__locals2) == 0x18, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass75_0
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::ChannelSession::<>c__DisplayClass75_0*
class CORDL_TYPE __ChannelSession____c__DisplayClass75_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field ar, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_ar, put = __cordl_internal_set_ar))::Unity::Services::Vivox::AsyncNoResult* ar;

  /// @brief Field request, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_request, put = __cordl_internal_set_request))::Unity::Services::Vivox::vx_req_session_send_message_t* request;

  static inline ::Unity::Services::Vivox::__ChannelSession____c__DisplayClass75_0* New_ctor();

  /// @brief Method <BeginSendText>b__0, addr 0x2fd7e60, size 0x160, virtual false, abstract: false, final false
  inline void _BeginSendText_b__0(::System::IAsyncResult* result);

  constexpr ::Unity::Services::Vivox::AsyncNoResult*& __cordl_internal_get_ar();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::AsyncNoResult*> const& __cordl_internal_get_ar() const;

  constexpr ::Unity::Services::Vivox::vx_req_session_send_message_t*& __cordl_internal_get_request();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::vx_req_session_send_message_t*> const& __cordl_internal_get_request() const;

  constexpr void __cordl_internal_set_ar(::Unity::Services::Vivox::AsyncNoResult* value);

