#pragma once
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/Collections/Generic/zzzz__List_1_def.hpp"
#include "System/Collections/ObjectModel/zzzz__ReadOnlyCollection_1_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__AsyncTaskMethodBuilder_1_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__AsyncTaskMethodBuilder_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__TaskAwaiter_1_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__TaskAwaiter_def.hpp"
#include "System/zzzz__DateTime_def.hpp"
#include "System/zzzz__Nullable_1_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "Unity/Services/Vivox/zzzz__ChannelType_def.hpp"
#include "Unity/Services/Vivox/zzzz__ChatCapability_def.hpp"
#include "Unity/Services/Vivox/zzzz__IChannelSession_def.hpp"
#include "Unity/Services/Vivox/zzzz__TransmissionMode_def.hpp"
#include "Unity/Services/Vivox/zzzz__VivoxConversation_def.hpp"
#include "Unity/Services/Vivox/zzzz__VivoxMessage_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(VivoxServiceInternal)
namespace System::Collections::Generic {
template <typename TKey, typename TValue> class Dictionary_2;
}
namespace System::Collections::Generic {
template <typename TKey, typename TValue> struct KeyValuePair_2;
}
namespace System::Collections::Generic {
template <typename T> class List_1;
}

MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___BlockPlayerAsync_d__175);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___DeleteChannelTextMessageAsync_d__165);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___DeleteDirectTextMessageAsync_d__162);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___DisableAutoVoiceActivityDetectionAsync_d__194);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___EditChannelTextMessageAsync_d__164);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___EditDirectTextMessageAsync_d__161);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___EnableAutoVoiceActivityDetectionAsync_d__193);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___GetChannelTextMessageHistoryAsync_d__166);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___GetConversationsAsync_d__168);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___GetDirectTextMessageHistoryAsync_d__167);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___InitializeAsync_d__153);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___JoinChannelAsync_d__180);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___JoinEchoChannelAsync_d__179);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___JoinGroupChannelAsync_d__177);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___JoinPositionalChannelAsync_d__178);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___LeaveAllChannelsAsync_d__181);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___LeaveChannelAsync_d__182);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___LoginAsync_d__154);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___LogoutAsync_d__155);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___SendChannelTextMessageAsync_d__163);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___SendDirectTextMessageAsync_d__160);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___SetActiveInputDeviceAsync_d__188);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___SetActiveOutputDeviceAsync_d__189);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___SetChannelTransmissionModeAsync_d__156);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___SetChannelVolumeAsync_d__192);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___SetMessageAsReadAsync_d__169);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___SetVoiceActivityDetectionPropertiesAsync_d__195);
MARK_VAL_T(::Unity::Services::Vivox::__VivoxServiceInternal___UnblockPlayerAsync_d__176);
// Type: ::<>c
// SizeInfo { instance_size: 16, native_size: -1, calculated_instance_size: 16, calculated_native_size: 16, minimum_alignment: 8, natural_alignment: 0, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::VivoxServiceInternal::<>c*
class CORDL_TYPE __VivoxServiceInternal____c : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>9, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF___9, put = setStaticF___9))::Unity::Services::Vivox::__VivoxServiceInternal____c* __9;

  /// @brief Field <>9__58_0, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF___9__58_0, put = setStaticF___9__58_0))::System::Func_2<
      ::System::Collections::Generic::KeyValuePair_2<::StringW, ::System::Collections::Generic::List_1<::Unity::Services::Vivox::VivoxParticipant*>*>, ::StringW>* __9__58_0;

  /// @brief Field <>9__58_1, offset 0xffffffff, size 0x8
  static __declspec(property(
      get = getStaticF___9__58_1,
      put = setStaticF___9__58_1))::System::Func_2<::System::Collections::Generic::KeyValuePair_2<::StringW, ::System::Collections::Generic::List_1<::Unity::Services::Vivox::VivoxParticipant*>*>,
                                                   ::System::Collections::ObjectModel::ReadOnlyCollection_1<::Unity::Services::Vivox::VivoxParticipant*>*>* __9__58_1;

  /// @brief Field <>9__64_0, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF___9__64_0, put = setStaticF___9__64_0))::System::Func_2<::Unity::Services::Vivox::ITTSVoice*, ::StringW>* __9__64_0;

  static inline ::Unity::Services::Vivox::__VivoxServiceInternal____c* New_ctor();

  /// @brief Method .ctor, addr 0x1c2298c, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method <get_ActiveChannels>b__58_0, addr 0x1c22994, size 0x3c, virtual false, abstract: false, final false
  inline ::StringW _get_ActiveChannels_b__58_0(::System::Collections::Generic::KeyValuePair_2<::StringW, ::System::Collections::Generic::List_1<::Unity::Services::Vivox::VivoxParticipant*>*> pair);

  /// @brief Method <get_ActiveChannels>b__58_1, addr 0x1c229d0, size 0x5c, virtual false, abstract: false, final false
  inline ::System::Collections::ObjectModel::ReadOnlyCollection_1<::Unity::Services::Vivox::VivoxParticipant*>*
  _get_ActiveChannels_b__58_1(::System::Collections::Generic::KeyValuePair_2<::StringW, ::System::Collections::Generic::List_1<::Unity::Services::Vivox::VivoxParticipant*>*> pair);

  /// @brief Method <get_TextToSpeechAvailableVoices>b__64_0, addr 0x1c22a2c, size 0x9c, virtual false, abstract: false, final false
  inline ::StringW _get_TextToSpeechAvailableVoices_b__64_0(::Unity::Services::Vivox::ITTSVoice* ttsVoice);

  static inline ::Unity::Services::Vivox::__VivoxServiceInternal____c* getStaticF___9();

  static inline ::System::Func_2<::System::Collections::Generic::KeyValuePair_2<::StringW, ::System::Collections::Generic::List_1<::Unity::Services::Vivox::VivoxParticipant*>*>, ::StringW>*
  getStaticF___9__58_0();

  static inline ::System::Func_2<::System::Collections::Generic::KeyValuePair_2<::StringW, ::System::Collections::Generic::List_1<::Unity::Services::Vivox::VivoxParticipant*>*>,
                                 ::System::Collections::ObjectModel::ReadOnlyCollection_1<::Unity::Services::Vivox::VivoxParticipant*>*>*
  getStaticF___9__58_1();

  static inline ::System::Func_2<::Unity::Services::Vivox::ITTSVoice*, ::StringW>* getStaticF___9__64_0();

  static inline void setStaticF___9(::Unity::Services::Vivox::__VivoxServiceInternal____c* value);

  static inline void setStaticF___9__58_0(
      ::System::Func_2<::System::Collections::Generic::KeyValuePair_2<::StringW, ::System::Collections::Generic::List_1<::Unity::Services::Vivox::VivoxParticipant*>*>, ::StringW>* value);

  static inline void
  setStaticF___9__58_1(::System::Func_2<::System::Collections::Generic::KeyValuePair_2<::StringW, ::System::Collections::Generic::List_1<::Unity::Services::Vivox::VivoxParticipant*>*>,
                                        ::System::Collections::ObjectModel::ReadOnlyCollection_1<::Unity::Services::Vivox::VivoxParticipant*>*>* value);

  static inline void setStaticF___9__64_0(::System::Func_2<::Unity::Services::Vivox::ITTSVoice*, ::StringW>* value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __VivoxServiceInternal____c();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__VivoxServiceInternal____c", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __VivoxServiceInternal____c(__VivoxServiceInternal____c&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__VivoxServiceInternal____c", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __VivoxServiceInternal____c(__VivoxServiceInternal____c const&) = delete;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__VivoxServiceInternal____c, 0x10>, "Size mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<InitializeAsync>d__153
// SizeInfo { instance_size: 56, native_size: -1, calculated_instance_size: 56, calculated_native_size: 72, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::VivoxServiceInternal::<InitializeAsync>d__153
struct CORDL_TYPE __VivoxServiceInternal___InitializeAsync_d__153 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x1c22ac8, size 0x564, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x1c2338c, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __VivoxServiceInternal___InitializeAsync_d__153();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "__4__this", ty: "::Unity::Services::Vivox::VivoxServiceInternal*", modifiers:
  // "", def_value: None }, CppParam { name: "options", ty: "::Unity::Services::Vivox::VivoxConfigurationOptions*", modifiers: "", def_value: None }, CppParam { name: "__u__1", ty:
  // "::System::Runtime::CompilerServices::TaskAwaiter", modifiers: "", def_value: None }]
  constexpr __VivoxServiceInternal___InitializeAsync_d__153(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder,
                                                            ::Unity::Services::Vivox::VivoxServiceInternal* __4__this, ::Unity::Services::Vivox::VivoxConfigurationOptions* options,
                                                            ::System::Runtime::CompilerServices::TaskAwaiter __u__1) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::Unity::Services::Vivox::VivoxServiceInternal* __4__this;

  /// @brief Field options, offset: 0x28, size: 0x8, def value: None
  ::Unity::Services::Vivox::VivoxConfigurationOptions* options;

  /// @brief Field <>u__1, offset: 0x30, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter __u__1;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x38 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__VivoxServiceInternal___InitializeAsync_d__153, 0x38>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___InitializeAsync_d__153, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___InitializeAsync_d__153, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___InitializeAsync_d__153, __4__this) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___InitializeAsync_d__153, options) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___InitializeAsync_d__153, __u__1) == 0x30, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<LoginAsync>d__154
// SizeInfo { instance_size: 80, native_size: -1, calculated_instance_size: 80, calculated_native_size: 96, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::VivoxServiceInternal::<LoginAsync>d__154
struct CORDL_TYPE __VivoxServiceInternal___LoginAsync_d__154 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x1c23398, size 0xa90, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x1c246a8, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __VivoxServiceInternal___LoginAsync_d__154();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "__4__this", ty: "::Unity::Services::Vivox::VivoxServiceInternal*", modifiers:
  // "", def_value: None }, CppParam { name: "loginOptions", ty: "::Unity::Services::Vivox::LoginOptions*", modifiers: "", def_value: None }, CppParam { name: "__u__1", ty:
  // "::System::Runtime::CompilerServices::TaskAwaiter", modifiers: "", def_value: None }, CppParam { name: "__7__wrap1", ty: "::System::Collections::Generic::__List_1__Enumerator<::StringW>",
  // modifiers: "", def_value: None }]
  constexpr __VivoxServiceInternal___LoginAsync_d__154(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder,
                                                       ::Unity::Services::Vivox::VivoxServiceInternal* __4__this, ::Unity::Services::Vivox::LoginOptions* loginOptions,
                                                       ::System::Runtime::CompilerServices::TaskAwaiter __u__1, ::System::Collections::Generic::__List_1__Enumerator<::StringW> __7__wrap1) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::Unity::Services::Vivox::VivoxServiceInternal* __4__this;

  /// @brief Field loginOptions, offset: 0x28, size: 0x8, def value: None
  ::Unity::Services::Vivox::LoginOptions* loginOptions;

  /// @brief Field <>u__1, offset: 0x30, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter __u__1;

  /// @brief Field <>7__wrap1, offset: 0x38, size: 0x18, def value: None
  ::System::Collections::Generic::__List_1__Enumerator<::StringW> __7__wrap1;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x50 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__VivoxServiceInternal___LoginAsync_d__154, 0x50>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___LoginAsync_d__154, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___LoginAsync_d__154, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___LoginAsync_d__154, __4__this) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___LoginAsync_d__154, loginOptions) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___LoginAsync_d__154, __u__1) == 0x30, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___LoginAsync_d__154, __7__wrap1) == 0x38, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<LogoutAsync>d__155
// SizeInfo { instance_size: 48, native_size: -1, calculated_instance_size: 48, calculated_native_size: 64, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::VivoxServiceInternal::<LogoutAsync>d__155
struct CORDL_TYPE __VivoxServiceInternal___LogoutAsync_d__155 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x1c246b4, size 0x2a8, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x1c2495c, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __VivoxServiceInternal___LogoutAsync_d__155();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "__4__this", ty: "::Unity::Services::Vivox::VivoxServiceInternal*", modifiers:
  // "", def_value: None }, CppParam { name: "__u__1", ty: "::System::Runtime::CompilerServices::TaskAwaiter", modifiers: "", def_value: None }]
  constexpr __VivoxServiceInternal___LogoutAsync_d__155(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder,
                                                        ::Unity::Services::Vivox::VivoxServiceInternal* __4__this, ::System::Runtime::CompilerServices::TaskAwaiter __u__1) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::Unity::Services::Vivox::VivoxServiceInternal* __4__this;

  /// @brief Field <>u__1, offset: 0x28, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter __u__1;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x30 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__VivoxServiceInternal___LogoutAsync_d__155, 0x30>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___LogoutAsync_d__155, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___LogoutAsync_d__155, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___LogoutAsync_d__155, __4__this) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___LogoutAsync_d__155, __u__1) == 0x28, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass156_0
// SizeInfo { instance_size: 24, native_size: -1, calculated_instance_size: 24, calculated_native_size: 24, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::VivoxServiceInternal::<>c__DisplayClass156_0*
class CORDL_TYPE __VivoxServiceInternal____c__DisplayClass156_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field channelName, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_channelName, put = __cordl_internal_set_channelName))::StringW channelName;

  static inline ::Unity::Services::Vivox::__VivoxServiceInternal____c__DisplayClass156_0* New_ctor();

  /// @brief Method <SetChannelTransmissionModeAsync>b__0, addr 0x1c24970, size 0xb4, virtual false, abstract: false, final false
  inline bool _SetChannelTransmissionModeAsync_b__0(::Unity::Services::Vivox::IChannelSession* c);

  constexpr ::StringW const& __cordl_internal_get_channelName() const;

  constexpr ::StringW& __cordl_internal_get_channelName();

  constexpr void __cordl_internal_set_channelName(::StringW value);

  /// @brief Method .ctor, addr 0x1c24968, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __VivoxServiceInternal____c__DisplayClass156_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__VivoxServiceInternal____c__DisplayClass156_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __VivoxServiceInternal____c__DisplayClass156_0(__VivoxServiceInternal____c__DisplayClass156_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__VivoxServiceInternal____c__DisplayClass156_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __VivoxServiceInternal____c__DisplayClass156_0(__VivoxServiceInternal____c__DisplayClass156_0 const&) = delete;

  /// @brief Field channelName, offset: 0x10, size: 0x8, def value: None
  ::StringW ___channelName;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__VivoxServiceInternal____c__DisplayClass156_0, 0x18>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal____c__DisplayClass156_0, ___channelName) == 0x10, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<SetChannelTransmissionModeAsync>d__156
// SizeInfo { instance_size: 64, native_size: -1, calculated_instance_size: 64, calculated_native_size: 80, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::VivoxServiceInternal::<SetChannelTransmissionModeAsync>d__156
struct CORDL_TYPE __VivoxServiceInternal___SetChannelTransmissionModeAsync_d__156 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x1c24a24, size 0x514, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x1c24f38, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __VivoxServiceInternal___SetChannelTransmissionModeAsync_d__156();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "channelName", ty: "::StringW", modifiers: "", def_value: None }, CppParam {
  // name: "transmissionMode", ty: "::Unity::Services::Vivox::TransmissionMode", modifiers: "", def_value: None }, CppParam { name: "__4__this", ty: "::Unity::Services::Vivox::VivoxServiceInternal*",
  // modifiers: "", def_value: None }, CppParam { name: "__u__1", ty: "::System::Runtime::CompilerServices::TaskAwaiter", modifiers: "", def_value: None }]
  constexpr __VivoxServiceInternal___SetChannelTransmissionModeAsync_d__156(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder, ::StringW channelName,
                                                                            ::Unity::Services::Vivox::TransmissionMode transmissionMode, ::Unity::Services::Vivox::VivoxServiceInternal* __4__this,
                                                                            ::System::Runtime::CompilerServices::TaskAwaiter __u__1) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field channelName, offset: 0x20, size: 0x8, def value: None
  ::StringW channelName;

  /// @brief Field transmissionMode, offset: 0x28, size: 0x4, def value: None
  ::Unity::Services::Vivox::TransmissionMode transmissionMode;

  /// @brief Field <>4__this, offset: 0x30, size: 0x8, def value: None
  ::Unity::Services::Vivox::VivoxServiceInternal* __4__this;

  /// @brief Field <>u__1, offset: 0x38, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter __u__1;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x40 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__VivoxServiceInternal___SetChannelTransmissionModeAsync_d__156, 0x40>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SetChannelTransmissionModeAsync_d__156, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SetChannelTransmissionModeAsync_d__156, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SetChannelTransmissionModeAsync_d__156, channelName) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SetChannelTransmissionModeAsync_d__156, transmissionMode) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SetChannelTransmissionModeAsync_d__156, __4__this) == 0x30, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SetChannelTransmissionModeAsync_d__156, __u__1) == 0x38, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<SendDirectTextMessageAsync>d__160
// SizeInfo { instance_size: 72, native_size: -1, calculated_instance_size: 72, calculated_native_size: 88, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::VivoxServiceInternal::<SendDirectTextMessageAsync>d__160
struct CORDL_TYPE __VivoxServiceInternal___SendDirectTextMessageAsync_d__160 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x1c24f44, size 0x2ac, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x1c251f0, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __VivoxServiceInternal___SendDirectTextMessageAsync_d__160();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "__4__this", ty: "::Unity::Services::Vivox::VivoxServiceInternal*", modifiers:
  // "", def_value: None }, CppParam { name: "playerId", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name: "message", ty: "::StringW", modifiers: "", def_value: None }, CppParam {
  // name: "options", ty: "::Unity::Services::Vivox::MessageOptions*", modifiers: "", def_value: None }, CppParam { name: "__u__1", ty: "::System::Runtime::CompilerServices::TaskAwaiter", modifiers:
  // "", def_value: None }]
  constexpr __VivoxServiceInternal___SendDirectTextMessageAsync_d__160(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder,
                                                                       ::Unity::Services::Vivox::VivoxServiceInternal* __4__this, ::StringW playerId, ::StringW message,
                                                                       ::Unity::Services::Vivox::MessageOptions* options, ::System::Runtime::CompilerServices::TaskAwaiter __u__1) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::Unity::Services::Vivox::VivoxServiceInternal* __4__this;

  /// @brief Field playerId, offset: 0x28, size: 0x8, def value: None
  ::StringW playerId;

  /// @brief Field message, offset: 0x30, size: 0x8, def value: None
  ::StringW message;

  /// @brief Field options, offset: 0x38, size: 0x8, def value: None
  ::Unity::Services::Vivox::MessageOptions* options;

  /// @brief Field <>u__1, offset: 0x40, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter __u__1;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x48 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__VivoxServiceInternal___SendDirectTextMessageAsync_d__160, 0x48>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SendDirectTextMessageAsync_d__160, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SendDirectTextMessageAsync_d__160, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SendDirectTextMessageAsync_d__160, __4__this) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SendDirectTextMessageAsync_d__160, playerId) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SendDirectTextMessageAsync_d__160, message) == 0x30, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SendDirectTextMessageAsync_d__160, options) == 0x38, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SendDirectTextMessageAsync_d__160, __u__1) == 0x40, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<EditDirectTextMessageAsync>d__161
// SizeInfo { instance_size: 64, native_size: -1, calculated_instance_size: 64, calculated_native_size: 80, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::VivoxServiceInternal::<EditDirectTextMessageAsync>d__161
struct CORDL_TYPE __VivoxServiceInternal___EditDirectTextMessageAsync_d__161 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x1c251fc, size 0x234, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x1c25430, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __VivoxServiceInternal___EditDirectTextMessageAsync_d__161();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "__4__this", ty: "::Unity::Services::Vivox::VivoxServiceInternal*", modifiers:
  // "", def_value: None }, CppParam { name: "messageId", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name: "newMessage", ty: "::StringW", modifiers: "", def_value: None }, CppParam
  // { name: "__u__1", ty: "::System::Runtime::CompilerServices::TaskAwaiter", modifiers: "", def_value: None }]
  constexpr __VivoxServiceInternal___EditDirectTextMessageAsync_d__161(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder,
                                                                       ::Unity::Services::Vivox::VivoxServiceInternal* __4__this, ::StringW messageId, ::StringW newMessage,
                                                                       ::System::Runtime::CompilerServices::TaskAwaiter __u__1) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::Unity::Services::Vivox::VivoxServiceInternal* __4__this;

  /// @brief Field messageId, offset: 0x28, size: 0x8, def value: None
  ::StringW messageId;

  /// @brief Field newMessage, offset: 0x30, size: 0x8, def value: None
  ::StringW newMessage;

  /// @brief Field <>u__1, offset: 0x38, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter __u__1;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x40 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__VivoxServiceInternal___EditDirectTextMessageAsync_d__161, 0x40>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___EditDirectTextMessageAsync_d__161, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___EditDirectTextMessageAsync_d__161, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___EditDirectTextMessageAsync_d__161, __4__this) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___EditDirectTextMessageAsync_d__161, messageId) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___EditDirectTextMessageAsync_d__161, newMessage) == 0x30, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___EditDirectTextMessageAsync_d__161, __u__1) == 0x38, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<DeleteDirectTextMessageAsync>d__162
// SizeInfo { instance_size: 56, native_size: -1, calculated_instance_size: 56, calculated_native_size: 72, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::VivoxServiceInternal::<DeleteDirectTextMessageAsync>d__162
struct CORDL_TYPE __VivoxServiceInternal___DeleteDirectTextMessageAsync_d__162 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x1c2543c, size 0x230, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x1c2566c, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __VivoxServiceInternal___DeleteDirectTextMessageAsync_d__162();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "__4__this", ty: "::Unity::Services::Vivox::VivoxServiceInternal*", modifiers:
  // "", def_value: None }, CppParam { name: "messageId", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name: "__u__1", ty: "::System::Runtime::CompilerServices::TaskAwaiter",
  // modifiers: "", def_value: None }]
  constexpr __VivoxServiceInternal___DeleteDirectTextMessageAsync_d__162(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder,
                                                                         ::Unity::Services::Vivox::VivoxServiceInternal* __4__this, ::StringW messageId,
                                                                         ::System::Runtime::CompilerServices::TaskAwaiter __u__1) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::Unity::Services::Vivox::VivoxServiceInternal* __4__this;

  /// @brief Field messageId, offset: 0x28, size: 0x8, def value: None
  ::StringW messageId;

  /// @brief Field <>u__1, offset: 0x30, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter __u__1;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x38 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__VivoxServiceInternal___DeleteDirectTextMessageAsync_d__162, 0x38>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___DeleteDirectTextMessageAsync_d__162, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___DeleteDirectTextMessageAsync_d__162, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___DeleteDirectTextMessageAsync_d__162, __4__this) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___DeleteDirectTextMessageAsync_d__162, messageId) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___DeleteDirectTextMessageAsync_d__162, __u__1) == 0x30, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass163_0
// SizeInfo { instance_size: 24, native_size: -1, calculated_instance_size: 24, calculated_native_size: 24, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::VivoxServiceInternal::<>c__DisplayClass163_0*
class CORDL_TYPE __VivoxServiceInternal____c__DisplayClass163_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field channelName, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_channelName, put = __cordl_internal_set_channelName))::StringW channelName;

  static inline ::Unity::Services::Vivox::__VivoxServiceInternal____c__DisplayClass163_0* New_ctor();

  /// @brief Method <SendChannelTextMessageAsync>b__0, addr 0x1c25680, size 0xb8, virtual false, abstract: false, final false
  inline bool _SendChannelTextMessageAsync_b__0(::Unity::Services::Vivox::IChannelSession* channel);

  constexpr ::StringW const& __cordl_internal_get_channelName() const;

  constexpr ::StringW& __cordl_internal_get_channelName();

  constexpr void __cordl_internal_set_channelName(::StringW value);

  /// @brief Method .ctor, addr 0x1c25678, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __VivoxServiceInternal____c__DisplayClass163_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__VivoxServiceInternal____c__DisplayClass163_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __VivoxServiceInternal____c__DisplayClass163_0(__VivoxServiceInternal____c__DisplayClass163_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__VivoxServiceInternal____c__DisplayClass163_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __VivoxServiceInternal____c__DisplayClass163_0(__VivoxServiceInternal____c__DisplayClass163_0 const&) = delete;

  /// @brief Field channelName, offset: 0x10, size: 0x8, def value: None
  ::StringW ___channelName;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__VivoxServiceInternal____c__DisplayClass163_0, 0x18>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal____c__DisplayClass163_0, ___channelName) == 0x10, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<SendChannelTextMessageAsync>d__163
// SizeInfo { instance_size: 72, native_size: -1, calculated_instance_size: 72, calculated_native_size: 88, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::VivoxServiceInternal::<SendChannelTextMessageAsync>d__163
struct CORDL_TYPE __VivoxServiceInternal___SendChannelTextMessageAsync_d__163 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x1c25738, size 0x374, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x1c25aac, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __VivoxServiceInternal___SendChannelTextMessageAsync_d__163();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "channelName", ty: "::StringW", modifiers: "", def_value: None }, CppParam {
  // name: "__4__this", ty: "::Unity::Services::Vivox::VivoxServiceInternal*", modifiers: "", def_value: None }, CppParam { name: "message", ty: "::StringW", modifiers: "", def_value: None }, CppParam
  // { name: "options", ty: "::Unity::Services::Vivox::MessageOptions*", modifiers: "", def_value: None }, CppParam { name: "__u__1", ty: "::System::Runtime::CompilerServices::TaskAwaiter", modifiers:
  // "", def_value: None }]
  constexpr __VivoxServiceInternal___SendChannelTextMessageAsync_d__163(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder, ::StringW channelName,
                                                                        ::Unity::Services::Vivox::VivoxServiceInternal* __4__this, ::StringW message, ::Unity::Services::Vivox::MessageOptions* options,
                                                                        ::System::Runtime::CompilerServices::TaskAwaiter __u__1) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field channelName, offset: 0x20, size: 0x8, def value: None
  ::StringW channelName;

  /// @brief Field <>4__this, offset: 0x28, size: 0x8, def value: None
  ::Unity::Services::Vivox::VivoxServiceInternal* __4__this;

  /// @brief Field message, offset: 0x30, size: 0x8, def value: None
  ::StringW message;

  /// @brief Field options, offset: 0x38, size: 0x8, def value: None
  ::Unity::Services::Vivox::MessageOptions* options;

  /// @brief Field <>u__1, offset: 0x40, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter __u__1;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x48 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__VivoxServiceInternal___SendChannelTextMessageAsync_d__163, 0x48>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SendChannelTextMessageAsync_d__163, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SendChannelTextMessageAsync_d__163, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SendChannelTextMessageAsync_d__163, channelName) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SendChannelTextMessageAsync_d__163, __4__this) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SendChannelTextMessageAsync_d__163, message) == 0x30, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SendChannelTextMessageAsync_d__163, options) == 0x38, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___SendChannelTextMessageAsync_d__163, __u__1) == 0x40, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass164_0
// SizeInfo { instance_size: 24, native_size: -1, calculated_instance_size: 24, calculated_native_size: 24, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::VivoxServiceInternal::<>c__DisplayClass164_0*
class CORDL_TYPE __VivoxServiceInternal____c__DisplayClass164_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field channelName, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_channelName, put = __cordl_internal_set_channelName))::StringW channelName;

  static inline ::Unity::Services::Vivox::__VivoxServiceInternal____c__DisplayClass164_0* New_ctor();

  /// @brief Method <EditChannelTextMessageAsync>b__0, addr 0x1c25ac0, size 0xb8, virtual false, abstract: false, final false
  inline bool _EditChannelTextMessageAsync_b__0(::Unity::Services::Vivox::IChannelSession* channel);

  constexpr ::StringW const& __cordl_internal_get_channelName() const;

  constexpr ::StringW& __cordl_internal_get_channelName();

  constexpr void __cordl_internal_set_channelName(::StringW value);

  /// @brief Method .ctor, addr 0x1c25ab8, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __VivoxServiceInternal____c__DisplayClass164_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__VivoxServiceInternal____c__DisplayClass164_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __VivoxServiceInternal____c__DisplayClass164_0(__VivoxServiceInternal____c__DisplayClass164_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__VivoxServiceInternal____c__DisplayClass164_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __VivoxServiceInternal____c__DisplayClass164_0(__VivoxServiceInternal____c__DisplayClass164_0 const&) = delete;

  /// @brief Field channelName, offset: 0x10, size: 0x8, def value: None
  ::StringW ___channelName;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__VivoxServiceInternal____c__DisplayClass164_0, 0x18>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal____c__DisplayClass164_0, ___channelName) == 0x10, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<EditChannelTextMessageAsync>d__164
// SizeInfo { instance_size: 72, native_size: -1, calculated_instance_size: 72, calculated_native_size: 88, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::VivoxServiceInternal::<EditChannelTextMessageAsync>d__164
struct CORDL_TYPE __VivoxServiceInternal___EditChannelTextMessageAsync_d__164 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x1c25b78, size 0x374, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x1c25eec, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __VivoxServiceInternal___EditChannelTextMessageAsync_d__164();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "channelName", ty: "::StringW", modifiers: "", def_value: None }, CppParam {
  // name: "__4__this", ty: "::Unity::Services::Vivox::VivoxServiceInternal*", modifiers: "", def_value: None }, CppParam { name: "messageId", ty: "::StringW", modifiers: "", def_value: None },
  // CppParam { name: "newMessage", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name: "__u__1", ty: "::System::Runtime::CompilerServices::TaskAwaiter", modifiers: "", def_value: None
  // }]
  constexpr __VivoxServiceInternal___EditChannelTextMessageAsync_d__164(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder, ::StringW channelName,
                                                                        ::Unity::Services::Vivox::VivoxServiceInternal* __4__this, ::StringW messageId, ::StringW newMessage,
                                                                        ::System::Runtime::CompilerServices::TaskAwaiter __u__1) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field channelName, offset: 0x20, size: 0x8, def value: None
  ::StringW channelName;

  /// @brief Field <>4__this, offset: 0x28, size: 0x8, def value: None
  ::Unity::Services::Vivox::VivoxServiceInternal* __4__this;

  /// @brief Field messageId, offset: 0x30, size: 0x8, def value: None
  ::StringW messageId;

  /// @brief Field newMessage, offset: 0x38, size: 0x8, def value: None
  ::StringW newMessage;

  /// @brief Field <>u__1, offset: 0x40, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter __u__1;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x48 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__VivoxServiceInternal___EditChannelTextMessageAsync_d__164, 0x48>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___EditChannelTextMessageAsync_d__164, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___EditChannelTextMessageAsync_d__164, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___EditChannelTextMessageAsync_d__164, channelName) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___EditChannelTextMessageAsync_d__164, __4__this) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___EditChannelTextMessageAsync_d__164, messageId) == 0x30, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___EditChannelTextMessageAsync_d__164, newMessage) == 0x38, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal___EditChannelTextMessageAsync_d__164, __u__1) == 0x40, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass165_0
// SizeInfo { instance_size: 24, native_size: -1, calculated_instance_size: 24, calculated_native_size: 24, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::VivoxServiceInternal::<>c__DisplayClass165_0*
class CORDL_TYPE __VivoxServiceInternal____c__DisplayClass165_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field channelName, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_channelName, put = __cordl_internal_set_channelName))::StringW channelName;

  static inline ::Unity::Services::Vivox::__VivoxServiceInternal____c__DisplayClass165_0* New_ctor();

  /// @brief Method <DeleteChannelTextMessageAsync>b__0, addr 0x1c25f00, size 0xb8, virtual false, abstract: false, final false
  inline bool _DeleteChannelTextMessageAsync_b__0(::Unity::Services::Vivox::IChannelSession* channel);

  constexpr ::StringW const& __cordl_internal_get_channelName() const;

  constexpr ::StringW& __cordl_internal_get_channelName();

  constexpr void __cordl_internal_set_channelName(::StringW value);

  /// @brief Method .ctor, addr 0x1c25ef8, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __VivoxServiceInternal____c__DisplayClass165_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__VivoxServiceInternal____c__DisplayClass165_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __VivoxServiceInternal____c__DisplayClass165_0(__VivoxServiceInternal____c__DisplayClass165_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__VivoxServiceInternal____c__DisplayClass165_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __VivoxServiceInternal____c__DisplayClass165_0(__VivoxServiceInternal____c__DisplayClass165_0 const&) = delete;

  /// @brief Field channelName, offset: 0x10, size: 0x8, def value: None
  ::StringW ___channelName;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__VivoxServiceInternal____c__DisplayClass165_0, 0x18>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__VivoxServiceInternal____c__DisplayClass165_0, ___channelName) == 0x10, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<DeleteChannelTextMessageAsync>d__165
// SizeInfo { instance_size: 64, native_size: -1, calculated_instance_size: 64, calculated_native_size: 80, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::VivoxServiceInternal::<DeleteChannelTextMessageAsync>d__165
struct CORDL_TYPE __VivoxServiceInternal___DeleteChannelTextMessageAsync_d__165 {
public:
  // Declarations
