#pragma once
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/Collections/Generic/zzzz__IList_1_def.hpp"
#include "System/Collections/Generic/zzzz__Queue_1_def.hpp"
#include "System/Collections/ObjectModel/zzzz__ReadOnlyCollection_1_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__AsyncTaskMethodBuilder_1_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__AsyncTaskMethodBuilder_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__AsyncVoidMethodBuilder_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__TaskAwaiter_1_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__TaskAwaiter_def.hpp"
#include "System/Threading/Tasks/zzzz__Task_def.hpp"
#include "System/zzzz__DateTime_def.hpp"
#include "System/zzzz__Nullable_1_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "Unity/Services/Vivox/zzzz__ConnectionRecoveryState_def.hpp"
#include "Unity/Services/Vivox/zzzz__IChatHistoryQueryResult_def.hpp"
#include "Unity/Services/Vivox/zzzz__LoginState_def.hpp"
#include "Unity/Services/Vivox/zzzz__ParticipantPropertyUpdateFrequency_def.hpp"
#include "Unity/Services/Vivox/zzzz__Presence_def.hpp"
#include "Unity/Services/Vivox/zzzz__SubscriptionMode_def.hpp"
#include "Unity/Services/Vivox/zzzz__TransmissionMode_def.hpp"
#include "Unity/Services/Vivox/zzzz__VivoxConversation_def.hpp"
#include "Unity/Services/Vivox/zzzz__VivoxMessage_def.hpp"

MARK_REF_PTR_T(::Unity::Services::Vivox::__LoginSession____c__DisplayClass153_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__LoginSession____c__DisplayClass167_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__LoginSession____c__DisplayClass168_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__LoginSession____c__DisplayClass169_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__LoginSession____c__DisplayClass170_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__LoginSession____c__DisplayClass171_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__LoginSession____c__DisplayClass172_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__LoginSession____c__DisplayClass173_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__LoginSession____c__DisplayClass174_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__LoginSession____c__DisplayClass41_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__LoginSession____c__DisplayClass42_0);
MARK_REF_PTR_T(::Unity::Services::Vivox::__LoginSession____c__DisplayClass88_0);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___BlockPlayerAsync_d__145);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___CheckConnectionAsync_d__157);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___DeleteChannelSessionAsync_d__119);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___DeleteDirectTextMessageAsync_d__152);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___EditDirectTextMessageAsync_d__151);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___GetConversationsAsync_d__136);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___GetDirectTextMessageHistoryAsync_d__135);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___GetDirectTextMessageHistoryPageAsync_d__134);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___LoginAsync_d__103);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___LogoutAsync_d__116);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___SendDirectedMessageAsync_d__104);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___SetAllSessionsTransmittingAsync_d__169);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___SetAutoVADAsync_d__173);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___SetMessageAsReadAsync_d__133);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___SetNoSessionTransmittingAsync_d__168);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___SetTransmissionAsync_d__166);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___SetTransmissionModeAsync_d__164);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___SetTransmittingAsync_d__167);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___SetVADPropertiesAsync_d__174);
MARK_VAL_T(::Unity::Services::Vivox::__LoginSession___WaitDeleteChannelSessionAsync_d__156);
// Type: ::<>c__DisplayClass41_0
// SizeInfo { instance_size: 24, native_size: -1, calculated_instance_size: 24, calculated_native_size: 24, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::LoginSession::<>c__DisplayClass41_0*
class CORDL_TYPE __LoginSession____c__DisplayClass41_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field message, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_message, put = __cordl_internal_set_message))::Unity::Services::Vivox::AccountArchiveMessage* message;

  static inline ::Unity::Services::Vivox::__LoginSession____c__DisplayClass41_0* New_ctor();

  /// @brief Method <HandleAccountArchiveMessage>b__0, addr 0x2ca1590, size 0xec, virtual false, abstract: false, final false
  inline ::System::Collections::Generic::IList_1<::Unity::Services::Vivox::VivoxMessage*>*
  _HandleAccountArchiveMessage_b__0(::StringW k, ::System::Collections::Generic::IList_1<::Unity::Services::Vivox::VivoxMessage*>* l);

  constexpr ::Unity::Services::Vivox::AccountArchiveMessage*& __cordl_internal_get_message();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::AccountArchiveMessage*> const& __cordl_internal_get_message() const;

  constexpr void __cordl_internal_set_message(::Unity::Services::Vivox::AccountArchiveMessage* value);

  /// @brief Method .ctor, addr 0x2ca1588, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __LoginSession____c__DisplayClass41_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass41_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __LoginSession____c__DisplayClass41_0(__LoginSession____c__DisplayClass41_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass41_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __LoginSession____c__DisplayClass41_0(__LoginSession____c__DisplayClass41_0 const&) = delete;

  /// @brief Field message, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::AccountArchiveMessage* ___message;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__LoginSession____c__DisplayClass41_0, 0x18>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass41_0, ___message) == 0x10, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass42_0
// SizeInfo { instance_size: 24, native_size: -1, calculated_instance_size: 24, calculated_native_size: 24, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::LoginSession::<>c__DisplayClass42_0*
class CORDL_TYPE __LoginSession____c__DisplayClass42_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field queryId, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_queryId, put = __cordl_internal_set_queryId))::StringW queryId;

  static inline ::Unity::Services::Vivox::__LoginSession____c__DisplayClass42_0* New_ctor();

  /// @brief Method <HandleAccountArchiveQueryEnd>b__0, addr 0x2ca1684, size 0x48, virtual false, abstract: false, final false
  inline bool _HandleAccountArchiveQueryEnd_b__0(::System::Collections::Generic::KeyValuePair_2<::StringW, ::System::Collections::Generic::IList_1<::Unity::Services::Vivox::VivoxMessage*>*> r);

  /// @brief Method <HandleAccountArchiveQueryEnd>b__1, addr 0x2ca16cc, size 0x48, virtual false, abstract: false, final false
  inline bool _HandleAccountArchiveQueryEnd_b__1(
      ::System::Collections::Generic::KeyValuePair_2<::StringW, ::System::Threading::Tasks::TaskCompletionSource_1<::Unity::Services::Vivox::IChatHistoryQueryResult*>*> r);

  constexpr ::StringW const& __cordl_internal_get_queryId() const;

  constexpr ::StringW& __cordl_internal_get_queryId();

  constexpr void __cordl_internal_set_queryId(::StringW value);

  /// @brief Method .ctor, addr 0x2ca167c, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __LoginSession____c__DisplayClass42_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass42_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __LoginSession____c__DisplayClass42_0(__LoginSession____c__DisplayClass42_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass42_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __LoginSession____c__DisplayClass42_0(__LoginSession____c__DisplayClass42_0 const&) = delete;

  /// @brief Field queryId, offset: 0x10, size: 0x8, def value: None
  ::StringW ___queryId;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__LoginSession____c__DisplayClass42_0, 0x18>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass42_0, ___queryId) == 0x10, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass88_0
// SizeInfo { instance_size: 56, native_size: -1, calculated_instance_size: 56, calculated_native_size: 56, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::LoginSession::<>c__DisplayClass88_0*
class CORDL_TYPE __LoginSession____c__DisplayClass88_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this))::Unity::Services::Vivox::LoginSession* __4__this;

  /// @brief Field ar, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_ar, put = __cordl_internal_set_ar))::Unity::Services::Vivox::AsyncNoResult* ar;

  /// @brief Field request, offset 0x30, size 0x8
  __declspec(property(get = __cordl_internal_get_request, put = __cordl_internal_set_request))::Unity::Services::Vivox::vx_req_account_set_presence_t* request;

  /// @brief Field value, offset 0x18, size 0x10
  __declspec(property(get = __cordl_internal_get_value, put = __cordl_internal_set_value))::Unity::Services::Vivox::Presence value;

  static inline ::Unity::Services::Vivox::__LoginSession____c__DisplayClass88_0* New_ctor();

  constexpr ::Unity::Services::Vivox::LoginSession*& __cordl_internal_get___4__this();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::LoginSession*> const& __cordl_internal_get___4__this() const;

  constexpr ::Unity::Services::Vivox::AsyncNoResult*& __cordl_internal_get_ar();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::AsyncNoResult*> const& __cordl_internal_get_ar() const;

  constexpr ::Unity::Services::Vivox::vx_req_account_set_presence_t*& __cordl_internal_get_request();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::vx_req_account_set_presence_t*> const& __cordl_internal_get_request() const;

  constexpr ::Unity::Services::Vivox::Presence const& __cordl_internal_get_value() const;

  constexpr ::Unity::Services::Vivox::Presence& __cordl_internal_get_value();

  constexpr void __cordl_internal_set___4__this(::Unity::Services::Vivox::LoginSession* value);

  constexpr void __cordl_internal_set_ar(::Unity::Services::Vivox::AsyncNoResult* value);

  constexpr void __cordl_internal_set_request(::Unity::Services::Vivox::vx_req_account_set_presence_t* value);

  constexpr void __cordl_internal_set_value(::Unity::Services::Vivox::Presence value);

  /// @brief Method .ctor, addr 0x2ca1714, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method <set_Presence>b__0, addr 0x2ca171c, size 0x208, virtual false, abstract: false, final false
  inline void _set_Presence_b__0(::System::IAsyncResult* result);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __LoginSession____c__DisplayClass88_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass88_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __LoginSession____c__DisplayClass88_0(__LoginSession____c__DisplayClass88_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass88_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __LoginSession____c__DisplayClass88_0(__LoginSession____c__DisplayClass88_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::LoginSession* _____4__this;

  /// @brief Field value, offset: 0x18, size: 0x10, def value: None
  ::Unity::Services::Vivox::Presence ___value;

  /// @brief Field ar, offset: 0x28, size: 0x8, def value: None
  ::Unity::Services::Vivox::AsyncNoResult* ___ar;

  /// @brief Field request, offset: 0x30, size: 0x8, def value: None
  ::Unity::Services::Vivox::vx_req_account_set_presence_t* ___request;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__LoginSession____c__DisplayClass88_0, 0x38>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass88_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass88_0, ___value) == 0x18, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass88_0, ___ar) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass88_0, ___request) == 0x30, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<LoginAsync>d__103
// SizeInfo { instance_size: 112, native_size: -1, calculated_instance_size: 112, calculated_native_size: 128, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::LoginSession::<LoginAsync>d__103
struct CORDL_TYPE __LoginSession___LoginAsync_d__103 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x2ca1924, size 0x74c, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x2ca2070, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __LoginSession___LoginAsync_d__103();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "accessToken", ty: "::StringW", modifiers: "", def_value: None }, CppParam {
  // name: "__4__this", ty: "::Unity::Services::Vivox::LoginSession*", modifiers: "", def_value: None }, CppParam { name: "presenceSubscriptions", ty:
  // "::Unity::Services::Vivox::IReadOnlyHashSet_1<::Unity::Services::Vivox::AccountId*>*", modifiers: "", def_value: None }, CppParam { name: "blockedPresenceSubscriptions", ty:
  // "::Unity::Services::Vivox::IReadOnlyHashSet_1<::Unity::Services::Vivox::AccountId*>*", modifiers: "", def_value: None }, CppParam { name: "allowedPresenceSubscriptions", ty:
  // "::Unity::Services::Vivox::IReadOnlyHashSet_1<::Unity::Services::Vivox::AccountId*>*", modifiers: "", def_value: None }, CppParam { name: "callback", ty: "::System::AsyncCallback*", modifiers:
  // "", def_value: None }, CppParam { name: "_tokenFetch_5__2", ty: "::System::Threading::Tasks::Task_1<::StringW>*", modifiers: "", def_value: None }, CppParam { name: "__u__1", ty:
  // "::System::Runtime::CompilerServices::TaskAwaiter_1<::StringW>", modifiers: "", def_value: None }, CppParam { name: "__u__2", ty:
  // "::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*>", modifiers: "", def_value: None }, CppParam { name: "__u__3", ty:
  // "::System::Runtime::CompilerServices::TaskAwaiter_1<bool>", modifiers: "", def_value: None }]
  constexpr __LoginSession___LoginAsync_d__103(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder, ::StringW accessToken,
                                               ::Unity::Services::Vivox::LoginSession* __4__this,
                                               ::Unity::Services::Vivox::IReadOnlyHashSet_1<::Unity::Services::Vivox::AccountId*>* presenceSubscriptions,
                                               ::Unity::Services::Vivox::IReadOnlyHashSet_1<::Unity::Services::Vivox::AccountId*>* blockedPresenceSubscriptions,
                                               ::Unity::Services::Vivox::IReadOnlyHashSet_1<::Unity::Services::Vivox::AccountId*>* allowedPresenceSubscriptions, ::System::AsyncCallback* callback,
                                               ::System::Threading::Tasks::Task_1<::StringW>* _tokenFetch_5__2, ::System::Runtime::CompilerServices::TaskAwaiter_1<::StringW> __u__1,
                                               ::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*> __u__2,
                                               ::System::Runtime::CompilerServices::TaskAwaiter_1<bool> __u__3) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field accessToken, offset: 0x20, size: 0x8, def value: None
  ::StringW accessToken;

  /// @brief Field <>4__this, offset: 0x28, size: 0x8, def value: None
  ::Unity::Services::Vivox::LoginSession* __4__this;

  /// @brief Field presenceSubscriptions, offset: 0x30, size: 0x8, def value: None
  ::Unity::Services::Vivox::IReadOnlyHashSet_1<::Unity::Services::Vivox::AccountId*>* presenceSubscriptions;

  /// @brief Field blockedPresenceSubscriptions, offset: 0x38, size: 0x8, def value: None
  ::Unity::Services::Vivox::IReadOnlyHashSet_1<::Unity::Services::Vivox::AccountId*>* blockedPresenceSubscriptions;

  /// @brief Field allowedPresenceSubscriptions, offset: 0x40, size: 0x8, def value: None
  ::Unity::Services::Vivox::IReadOnlyHashSet_1<::Unity::Services::Vivox::AccountId*>* allowedPresenceSubscriptions;

  /// @brief Field callback, offset: 0x48, size: 0x8, def value: None
  ::System::AsyncCallback* callback;

  /// @brief Field <tokenFetch>5__2, offset: 0x50, size: 0x8, def value: None
  ::System::Threading::Tasks::Task_1<::StringW>* _tokenFetch_5__2;

  /// @brief Field <>u__1, offset: 0x58, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter_1<::StringW> __u__1;

  /// @brief Field <>u__2, offset: 0x60, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*> __u__2;

  /// @brief Field <>u__3, offset: 0x68, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter_1<bool> __u__3;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x70 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__LoginSession___LoginAsync_d__103, 0x70>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LoginAsync_d__103, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LoginAsync_d__103, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LoginAsync_d__103, accessToken) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LoginAsync_d__103, __4__this) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LoginAsync_d__103, presenceSubscriptions) == 0x30, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LoginAsync_d__103, blockedPresenceSubscriptions) == 0x38, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LoginAsync_d__103, allowedPresenceSubscriptions) == 0x40, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LoginAsync_d__103, callback) == 0x48, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LoginAsync_d__103, _tokenFetch_5__2) == 0x50, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LoginAsync_d__103, __u__1) == 0x58, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LoginAsync_d__103, __u__2) == 0x60, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LoginAsync_d__103, __u__3) == 0x68, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<SendDirectedMessageAsync>d__104
// SizeInfo { instance_size: 72, native_size: -1, calculated_instance_size: 72, calculated_native_size: 88, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::LoginSession::<SendDirectedMessageAsync>d__104
struct CORDL_TYPE __LoginSession___SendDirectedMessageAsync_d__104 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x2ca207c, size 0x2cc, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x2ca2348, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __LoginSession___SendDirectedMessageAsync_d__104();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "__4__this", ty: "::Unity::Services::Vivox::LoginSession*", modifiers: "",
  // def_value: None }, CppParam { name: "accountId", ty: "::Unity::Services::Vivox::AccountId*", modifiers: "", def_value: None }, CppParam { name: "message", ty: "::StringW", modifiers: "",
  // def_value: None }, CppParam { name: "options", ty: "::Unity::Services::Vivox::MessageOptions*", modifiers: "", def_value: None }, CppParam { name: "__u__1", ty:
  // "::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*>", modifiers: "", def_value: None }]
  constexpr __LoginSession___SendDirectedMessageAsync_d__104(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder,
                                                             ::Unity::Services::Vivox::LoginSession* __4__this, ::Unity::Services::Vivox::AccountId* accountId, ::StringW message,
                                                             ::Unity::Services::Vivox::MessageOptions* options,
                                                             ::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*> __u__1) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::Unity::Services::Vivox::LoginSession* __4__this;

  /// @brief Field accountId, offset: 0x28, size: 0x8, def value: None
  ::Unity::Services::Vivox::AccountId* accountId;

  /// @brief Field message, offset: 0x30, size: 0x8, def value: None
  ::StringW message;

  /// @brief Field options, offset: 0x38, size: 0x8, def value: None
  ::Unity::Services::Vivox::MessageOptions* options;

  /// @brief Field <>u__1, offset: 0x40, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*> __u__1;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x48 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__LoginSession___SendDirectedMessageAsync_d__104, 0x48>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___SendDirectedMessageAsync_d__104, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___SendDirectedMessageAsync_d__104, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___SendDirectedMessageAsync_d__104, __4__this) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___SendDirectedMessageAsync_d__104, accountId) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___SendDirectedMessageAsync_d__104, message) == 0x30, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___SendDirectedMessageAsync_d__104, options) == 0x38, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___SendDirectedMessageAsync_d__104, __u__1) == 0x40, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass105_0
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::LoginSession::<>c__DisplayClass105_0*
class CORDL_TYPE __LoginSession____c__DisplayClass105_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field ar, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_ar, put = __cordl_internal_set_ar))::Unity::Services::Vivox::AsyncResult_1<::StringW>* ar;

  /// @brief Field request, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_request, put = __cordl_internal_set_request))::Unity::Services::Vivox::vx_req_account_chat_history_query_t* request;

  static inline ::Unity::Services::Vivox::__LoginSession____c__DisplayClass105_0* New_ctor();

  /// @brief Method <BeginChatHistoryQuery>b__0, addr 0x2ca235c, size 0x1a0, virtual false, abstract: false, final false
  inline void _BeginChatHistoryQuery_b__0(::System::IAsyncResult* result);

  constexpr ::Unity::Services::Vivox::AsyncResult_1<::StringW>*& __cordl_internal_get_ar();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::AsyncResult_1<::StringW>*> const& __cordl_internal_get_ar() const;

  constexpr ::Unity::Services::Vivox::vx_req_account_chat_history_query_t*& __cordl_internal_get_request();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::vx_req_account_chat_history_query_t*> const& __cordl_internal_get_request() const;

  constexpr void __cordl_internal_set_ar(::Unity::Services::Vivox::AsyncResult_1<::StringW>* value);

  constexpr void __cordl_internal_set_request(::Unity::Services::Vivox::vx_req_account_chat_history_query_t* value);

  /// @brief Method .ctor, addr 0x2ca2354, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __LoginSession____c__DisplayClass105_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass105_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __LoginSession____c__DisplayClass105_0(__LoginSession____c__DisplayClass105_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass105_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __LoginSession____c__DisplayClass105_0(__LoginSession____c__DisplayClass105_0 const&) = delete;

  /// @brief Field ar, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::AsyncResult_1<::StringW>* ___ar;

  /// @brief Field request, offset: 0x18, size: 0x8, def value: None
  ::Unity::Services::Vivox::vx_req_account_chat_history_query_t* ___request;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__LoginSession____c__DisplayClass105_0, 0x20>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass105_0, ___ar) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass105_0, ___request) == 0x18, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass110_0
// SizeInfo { instance_size: 56, native_size: -1, calculated_instance_size: 56, calculated_native_size: 52, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::LoginSession::<>c__DisplayClass110_0*
class CORDL_TYPE __LoginSession____c__DisplayClass110_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this))::Unity::Services::Vivox::LoginSession* __4__this;

  /// @brief Field accessToken, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_accessToken, put = __cordl_internal_set_accessToken))::StringW accessToken;

  /// @brief Field presenceDesired, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get_presenceDesired, put = __cordl_internal_set_presenceDesired)) bool presenceDesired;

  /// @brief Field result, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_result, put = __cordl_internal_set_result))::Unity::Services::Vivox::AsyncNoResult* result;

  /// @brief Field subscriptionMode, offset 0x30, size 0x4
  __declspec(property(get = __cordl_internal_get_subscriptionMode, put = __cordl_internal_set_subscriptionMode))::Unity::Services::Vivox::SubscriptionMode subscriptionMode;

  static inline ::Unity::Services::Vivox::__LoginSession____c__DisplayClass110_0* New_ctor();

  /// @brief Method <BeginLogin>b__0, addr 0x2ca2504, size 0x1b0, virtual false, abstract: false, final false
  inline void _BeginLogin_b__0(::System::IAsyncResult* ar2);

  constexpr ::Unity::Services::Vivox::LoginSession*& __cordl_internal_get___4__this();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::LoginSession*> const& __cordl_internal_get___4__this() const;

  constexpr ::StringW const& __cordl_internal_get_accessToken() const;

  constexpr ::StringW& __cordl_internal_get_accessToken();

  constexpr bool const& __cordl_internal_get_presenceDesired() const;

  constexpr bool& __cordl_internal_get_presenceDesired();

  constexpr ::Unity::Services::Vivox::AsyncNoResult*& __cordl_internal_get_result();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::AsyncNoResult*> const& __cordl_internal_get_result() const;

  constexpr ::Unity::Services::Vivox::SubscriptionMode const& __cordl_internal_get_subscriptionMode() const;

  constexpr ::Unity::Services::Vivox::SubscriptionMode& __cordl_internal_get_subscriptionMode();

  constexpr void __cordl_internal_set___4__this(::Unity::Services::Vivox::LoginSession* value);

  constexpr void __cordl_internal_set_accessToken(::StringW value);

  constexpr void __cordl_internal_set_presenceDesired(bool value);

  constexpr void __cordl_internal_set_result(::Unity::Services::Vivox::AsyncNoResult* value);

  constexpr void __cordl_internal_set_subscriptionMode(::Unity::Services::Vivox::SubscriptionMode value);

  /// @brief Method .ctor, addr 0x2ca24fc, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __LoginSession____c__DisplayClass110_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass110_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __LoginSession____c__DisplayClass110_0(__LoginSession____c__DisplayClass110_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass110_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __LoginSession____c__DisplayClass110_0(__LoginSession____c__DisplayClass110_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::LoginSession* _____4__this;

  /// @brief Field result, offset: 0x18, size: 0x8, def value: None
  ::Unity::Services::Vivox::AsyncNoResult* ___result;

  /// @brief Field presenceDesired, offset: 0x20, size: 0x1, def value: None
  bool ___presenceDesired;

  /// @brief Field accessToken, offset: 0x28, size: 0x8, def value: None
  ::StringW ___accessToken;

  /// @brief Field subscriptionMode, offset: 0x30, size: 0x4, def value: None
  ::Unity::Services::Vivox::SubscriptionMode ___subscriptionMode;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__LoginSession____c__DisplayClass110_0, 0x38>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass110_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass110_0, ___result) == 0x18, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass110_0, ___presenceDesired) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass110_0, ___accessToken) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass110_0, ___subscriptionMode) == 0x30, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass114_0
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::LoginSession::<>c__DisplayClass114_0*
class CORDL_TYPE __LoginSession____c__DisplayClass114_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field ar, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_ar, put = __cordl_internal_set_ar))::Unity::Services::Vivox::AsyncNoResult* ar;

  /// @brief Field request, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_request, put = __cordl_internal_set_request))::Unity::Services::Vivox::vx_req_account_anonymous_login_t* request;

  static inline ::Unity::Services::Vivox::__LoginSession____c__DisplayClass114_0* New_ctor();

  /// @brief Method <Login>b__0, addr 0x2ca26bc, size 0x144, virtual false, abstract: false, final false
  inline void _Login_b__0(::System::IAsyncResult* result);

  constexpr ::Unity::Services::Vivox::AsyncNoResult*& __cordl_internal_get_ar();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::AsyncNoResult*> const& __cordl_internal_get_ar() const;

  constexpr ::Unity::Services::Vivox::vx_req_account_anonymous_login_t*& __cordl_internal_get_request();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::vx_req_account_anonymous_login_t*> const& __cordl_internal_get_request() const;

  constexpr void __cordl_internal_set_ar(::Unity::Services::Vivox::AsyncNoResult* value);

  constexpr void __cordl_internal_set_request(::Unity::Services::Vivox::vx_req_account_anonymous_login_t* value);

  /// @brief Method .ctor, addr 0x2ca26b4, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __LoginSession____c__DisplayClass114_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass114_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __LoginSession____c__DisplayClass114_0(__LoginSession____c__DisplayClass114_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass114_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __LoginSession____c__DisplayClass114_0(__LoginSession____c__DisplayClass114_0 const&) = delete;

  /// @brief Field ar, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::AsyncNoResult* ___ar;

  /// @brief Field request, offset: 0x18, size: 0x8, def value: None
  ::Unity::Services::Vivox::vx_req_account_anonymous_login_t* ___request;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__LoginSession____c__DisplayClass114_0, 0x20>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass114_0, ___ar) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass114_0, ___request) == 0x18, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass116_0
// SizeInfo { instance_size: 24, native_size: -1, calculated_instance_size: 24, calculated_native_size: 24, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::LoginSession::<>c__DisplayClass116_0*
class CORDL_TYPE __LoginSession____c__DisplayClass116_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field request, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_request, put = __cordl_internal_set_request))::Unity::Services::Vivox::vx_req_account_logout_t* request;

  static inline ::Unity::Services::Vivox::__LoginSession____c__DisplayClass116_0* New_ctor();

  /// @brief Method <LogoutAsync>b__0, addr 0x2ca2808, size 0x184, virtual false, abstract: false, final false
  inline ::System::Threading::Tasks::Task* _LogoutAsync_b__0(::System::IAsyncResult* ar);

  constexpr ::Unity::Services::Vivox::vx_req_account_logout_t*& __cordl_internal_get_request();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::vx_req_account_logout_t*> const& __cordl_internal_get_request() const;

  constexpr void __cordl_internal_set_request(::Unity::Services::Vivox::vx_req_account_logout_t* value);

  /// @brief Method .ctor, addr 0x2ca2800, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __LoginSession____c__DisplayClass116_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass116_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __LoginSession____c__DisplayClass116_0(__LoginSession____c__DisplayClass116_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass116_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __LoginSession____c__DisplayClass116_0(__LoginSession____c__DisplayClass116_0 const&) = delete;

  /// @brief Field request, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::vx_req_account_logout_t* ___request;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__LoginSession____c__DisplayClass116_0, 0x18>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass116_0, ___request) == 0x10, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<LogoutAsync>d__116
// SizeInfo { instance_size: 48, native_size: -1, calculated_instance_size: 48, calculated_native_size: 64, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::LoginSession::<LogoutAsync>d__116
struct CORDL_TYPE __LoginSession___LogoutAsync_d__116 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x2ca298c, size 0x398, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x2ca2d24, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __LoginSession___LogoutAsync_d__116();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "__4__this", ty: "::Unity::Services::Vivox::LoginSession*", modifiers: "",
  // def_value: None }, CppParam { name: "__u__1", ty: "::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*>", modifiers: "", def_value: None }]
  constexpr __LoginSession___LogoutAsync_d__116(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder, ::Unity::Services::Vivox::LoginSession* __4__this,
                                                ::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*> __u__1) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::Unity::Services::Vivox::LoginSession* __4__this;

  /// @brief Field <>u__1, offset: 0x28, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter_1<::System::Threading::Tasks::Task*> __u__1;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x30 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__LoginSession___LogoutAsync_d__116, 0x30>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LogoutAsync_d__116, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LogoutAsync_d__116, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LogoutAsync_d__116, __4__this) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___LogoutAsync_d__116, __u__1) == 0x28, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<DeleteChannelSessionAsync>d__119
// SizeInfo { instance_size: 56, native_size: -1, calculated_instance_size: 56, calculated_native_size: 72, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: true
// CS Name: ::LoginSession::<DeleteChannelSessionAsync>d__119
struct CORDL_TYPE __LoginSession___DeleteChannelSessionAsync_d__119 {
public:
  // Declarations
  /// @brief Convert operator to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr operator ::System::Runtime::CompilerServices::IAsyncStateMachine*();

  /// @brief Method MoveNext, addr 0x2ca2d30, size 0x3bc, virtual true, abstract: false, final true
  inline void MoveNext();

  /// @brief Method SetStateMachine, addr 0x2ca30ec, size 0xc, virtual true, abstract: false, final true
  inline void SetStateMachine(::System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine);

  /// @brief Convert to "::System::Runtime::CompilerServices::IAsyncStateMachine"
  constexpr ::System::Runtime::CompilerServices::IAsyncStateMachine* i___System__Runtime__CompilerServices__IAsyncStateMachine();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __LoginSession___DeleteChannelSessionAsync_d__119();

  // Ctor Parameters [CppParam { name: "__1__state", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "__t__builder", ty:
  // "::System::Runtime::CompilerServices::AsyncTaskMethodBuilder", modifiers: "", def_value: None }, CppParam { name: "__4__this", ty: "::Unity::Services::Vivox::LoginSession*", modifiers: "",
  // def_value: None }, CppParam { name: "channelId", ty: "::Unity::Services::Vivox::ChannelId*", modifiers: "", def_value: None }, CppParam { name: "__u__1", ty:
  // "::System::Runtime::CompilerServices::TaskAwaiter", modifiers: "", def_value: None }]
  constexpr __LoginSession___DeleteChannelSessionAsync_d__119(int32_t __1__state, ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder,
                                                              ::Unity::Services::Vivox::LoginSession* __4__this, ::Unity::Services::Vivox::ChannelId* channelId,
                                                              ::System::Runtime::CompilerServices::TaskAwaiter __u__1) noexcept;

  /// @brief Field <>1__state, offset: 0x0, size: 0x4, def value: None
  int32_t __1__state;

  /// @brief Field <>t__builder, offset: 0x8, size: 0x18, def value: None
  ::System::Runtime::CompilerServices::AsyncTaskMethodBuilder __t__builder;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::Unity::Services::Vivox::LoginSession* __4__this;

  /// @brief Field channelId, offset: 0x28, size: 0x8, def value: None
  ::Unity::Services::Vivox::ChannelId* channelId;

  /// @brief Field <>u__1, offset: 0x30, size: 0x8, def value: None
  ::System::Runtime::CompilerServices::TaskAwaiter __u__1;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x38 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__LoginSession___DeleteChannelSessionAsync_d__119, 0x38>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___DeleteChannelSessionAsync_d__119, __1__state) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___DeleteChannelSessionAsync_d__119, __t__builder) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___DeleteChannelSessionAsync_d__119, __4__this) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___DeleteChannelSessionAsync_d__119, channelId) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession___DeleteChannelSessionAsync_d__119, __u__1) == 0x30, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass120_0
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::LoginSession::<>c__DisplayClass120_0*
class CORDL_TYPE __LoginSession____c__DisplayClass120_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this))::Unity::Services::Vivox::LoginSession* __4__this;

  /// @brief Field request, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_request, put = __cordl_internal_set_request))::Unity::Services::Vivox::vx_req_sessiongroup_control_audio_injection_t* request;

  static inline ::Unity::Services::Vivox::__LoginSession____c__DisplayClass120_0* New_ctor();

  /// @brief Method <StartAudioInjection>b__1, addr 0x2ca3100, size 0x12c, virtual false, abstract: false, final false
  inline void _StartAudioInjection_b__1(::System::IAsyncResult* result);

  constexpr ::Unity::Services::Vivox::LoginSession*& __cordl_internal_get___4__this();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::LoginSession*> const& __cordl_internal_get___4__this() const;

  constexpr ::Unity::Services::Vivox::vx_req_sessiongroup_control_audio_injection_t*& __cordl_internal_get_request();

  constexpr ::cordl_internals::to_const_pointer<::Unity::Services::Vivox::vx_req_sessiongroup_control_audio_injection_t*> const& __cordl_internal_get_request() const;

  constexpr void __cordl_internal_set___4__this(::Unity::Services::Vivox::LoginSession* value);

  constexpr void __cordl_internal_set_request(::Unity::Services::Vivox::vx_req_sessiongroup_control_audio_injection_t* value);

  /// @brief Method .ctor, addr 0x2ca30f8, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __LoginSession____c__DisplayClass120_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass120_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __LoginSession____c__DisplayClass120_0(__LoginSession____c__DisplayClass120_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c__DisplayClass120_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __LoginSession____c__DisplayClass120_0(__LoginSession____c__DisplayClass120_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::Unity::Services::Vivox::LoginSession* _____4__this;

  /// @brief Field request, offset: 0x18, size: 0x8, def value: None
  ::Unity::Services::Vivox::vx_req_sessiongroup_control_audio_injection_t* ___request;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__LoginSession____c__DisplayClass120_0, 0x20>, "Size mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass120_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Unity::Services::Vivox::__LoginSession____c__DisplayClass120_0, ___request) == 0x18, "Offset mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c
// SizeInfo { instance_size: 16, native_size: -1, calculated_instance_size: 16, calculated_native_size: 16, minimum_alignment: 8, natural_alignment: 0, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::LoginSession::<>c*
class CORDL_TYPE __LoginSession____c : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>9, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF___9, put = setStaticF___9))::Unity::Services::Vivox::__LoginSession____c* __9;

  /// @brief Field <>9__120_0, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF___9__120_0, put = setStaticF___9__120_0))::System::Func_2<::Unity::Services::Vivox::IChannelSession*, bool>* __9__120_0;

  /// @brief Field <>9__121_0, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF___9__121_0, put = setStaticF___9__121_0))::System::Func_2<::Unity::Services::Vivox::IChannelSession*, bool>* __9__121_0;

  /// @brief Field <>9__145_0, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF___9__145_0, put = setStaticF___9__145_0))::System::Func_2<::System::IAsyncResult*, ::System::Threading::Tasks::Task*>* __9__145_0;

  /// @brief Field <>9__151_0, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF___9__151_0, put = setStaticF___9__151_0))::System::Func_2<::System::IAsyncResult*, ::System::Threading::Tasks::Task*>* __9__151_0;

  /// @brief Field <>9__152_0, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF___9__152_0, put = setStaticF___9__152_0))::System::Func_2<::System::IAsyncResult*, ::System::Threading::Tasks::Task*>* __9__152_0;

  static inline ::Unity::Services::Vivox::__LoginSession____c* New_ctor();

  /// @brief Method <BlockPlayerAsync>b__145_0, addr 0x2ca345c, size 0x88, virtual false, abstract: false, final false
  inline ::System::Threading::Tasks::Task* _BlockPlayerAsync_b__145_0(::System::IAsyncResult* ar);

  /// @brief Method <DeleteDirectTextMessageAsync>b__152_0, addr 0x2ca363c, size 0x158, virtual false, abstract: false, final false
  inline ::System::Threading::Tasks::Task* _DeleteDirectTextMessageAsync_b__152_0(::System::IAsyncResult* ar);

  /// @brief Method <EditDirectTextMessageAsync>b__151_0, addr 0x2ca34e4, size 0x158, virtual false, abstract: false, final false
  inline ::System::Threading::Tasks::Task* _EditDirectTextMessageAsync_b__151_0(::System::IAsyncResult* ar);

  /// @brief Method <StartAudioInjection>b__120_0, addr 0x2ca3298, size 0xac, virtual false, abstract: false, final false
  inline bool _StartAudioInjection_b__120_0(::Unity::Services::Vivox::IChannelSession* cs);

  /// @brief Method <StopAudioInjection>b__121_0, addr 0x2ca3344, size 0x118, virtual false, abstract: false, final false
  inline bool _StopAudioInjection_b__121_0(::Unity::Services::Vivox::IChannelSession* cs);

  /// @brief Method .ctor, addr 0x2ca3290, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  static inline ::Unity::Services::Vivox::__LoginSession____c* getStaticF___9();

  static inline ::System::Func_2<::Unity::Services::Vivox::IChannelSession*, bool>* getStaticF___9__120_0();

  static inline ::System::Func_2<::Unity::Services::Vivox::IChannelSession*, bool>* getStaticF___9__121_0();

  static inline ::System::Func_2<::System::IAsyncResult*, ::System::Threading::Tasks::Task*>* getStaticF___9__145_0();

  static inline ::System::Func_2<::System::IAsyncResult*, ::System::Threading::Tasks::Task*>* getStaticF___9__151_0();

  static inline ::System::Func_2<::System::IAsyncResult*, ::System::Threading::Tasks::Task*>* getStaticF___9__152_0();

  static inline void setStaticF___9(::Unity::Services::Vivox::__LoginSession____c* value);

  static inline void setStaticF___9__120_0(::System::Func_2<::Unity::Services::Vivox::IChannelSession*, bool>* value);

  static inline void setStaticF___9__121_0(::System::Func_2<::Unity::Services::Vivox::IChannelSession*, bool>* value);

  static inline void setStaticF___9__145_0(::System::Func_2<::System::IAsyncResult*, ::System::Threading::Tasks::Task*>* value);

  static inline void setStaticF___9__151_0(::System::Func_2<::System::IAsyncResult*, ::System::Threading::Tasks::Task*>* value);

  static inline void setStaticF___9__152_0(::System::Func_2<::System::IAsyncResult*, ::System::Threading::Tasks::Task*>* value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __LoginSession____c();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __LoginSession____c(__LoginSession____c&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__LoginSession____c", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __LoginSession____c(__LoginSession____c const&) = delete;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Services::Vivox::__LoginSession____c, 0x10>, "Size mismatch!");

} // namespace Unity::Services::Vivox
// Type: ::<>c__DisplayClass121_0
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Services::Vivox {
// Is value type: false
// CS Name: ::LoginSession::<>c__DisplayClass121_0*
class CORDL_TYPE __LoginSession____c__DisplayClass121_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this))::Unity::Services::Vivox::LoginSession* __4__this;

  /// @brief Field request, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_request, put = __cordl_internal_set_request))::Unity::Services::Vivox::vx_req_sessiongroup_control_audio_injection_t* request;

  static inline ::Unity::Services::Vivox::__LoginSession____c__DisplayClass121_0* New_ctor();

  /// @brief Method <StopAudioInjection>b__1, addr 0x2ca379c, size 0x12c, virtual false, abstract: false, final false
  inline void _StopAudioInjection_b__1(::System::IAsyncResult* result);

  constexpr ::Unity::Services::Vivox::LoginSession*& __cordl_internal_get___4__this();

